[
    {
      "id": "ipc_96",
      "title": "Right to Private Defence - Section 96 IPC",
      "section": "Section 96 IPC",
      "category": "Criminal Law",
      "text": "Nothing is an offence which is done in the exercise of the right of private defence.",
      "simplified_summary": "You have the right to defend yourself and others from harm without it being considered a crime.",
      "real_life_example": "If someone attacks you with a weapon, you can use force to protect yourself without being charged with assault.",
      "punishment": "No punishment - it is a legal right",
      "keywords": ["self defense", "private defence", "right to defend", "protection", "Section 96"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_97",
      "title": "Right to Defend Body and Property - Section 97 IPC",
      "section": "Section 97 IPC",
      "category": "Criminal Law",
      "text": "Every person has a right, subject to the restrictions contained in Section 99, to defend his own body, and the body of any other person, against any offence affecting the human body; and the property, whether movable or immovable, of himself or of any other person, against any act which is an offence falling under the definition of theft, robbery, mischief or criminal trespass.",
      "simplified_summary": "You can defend yourself, others, and property from criminal attacks including theft, robbery, and trespassing.",
      "real_life_example": "If someone tries to steal your car, you can use reasonable force to stop them and protect your property.",
      "punishment": "No punishment - it is a legal right",
      "keywords": ["body defence", "property defence", "theft", "robbery", "trespassing", "Section 97"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_99",
      "title": "Limitations on Right of Private Defence - Section 99 IPC",
      "section": "Section 99 IPC",
      "category": "Criminal Law",
      "text": "There is no right of private defence in cases in which there is time to have recourse to the protection of the public authorities. The right of private defence in no case extends to the inflicting of more harm than it is necessary to inflict for the purpose of defence.",
      "simplified_summary": "You cannot claim self-defense if you had time to call police, or if you used more force than necessary.",
      "real_life_example": "If someone insults you and you have time to walk away or call police, you cannot attack them and claim self-defense.",
      "punishment": "May face criminal charges for excessive force",
      "keywords": ["limitations", "excessive force", "public authorities", "necessary force", "Section 99"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_100",
      "title": "When Right of Private Defence Extends to Causing Death - Section 100 IPC",
      "section": "Section 100 IPC",
      "category": "Criminal Law",
      "text": "The right of private defence of the body extends, under the restrictions mentioned in the last preceding section, to the voluntary causing of death or of any other harm to the assailant, if the offence which occasions the exercise of the right be of any of the descriptions hereinafter enumerated: (1) Such an assault as may reasonably cause the apprehension that death will otherwise be the consequence of such assault; (2) Such an assault as may reasonably cause the apprehension that grievous hurt will otherwise be the consequence of such assault; (3) An assault with the intention of committing rape; (4) An assault with the intention of gratifying unnatural lust; (5) An assault with the intention of kidnapping or abducting; (6) An assault with the intention of wrongfully confining a person, under circumstances which may reasonably cause him to apprehend that he will be unable to have recourse to the public authorities for his release.",
      "simplified_summary": "You can use deadly force in self-defense when facing serious threats like murder, rape, kidnapping, or grievous hurt.",
      "real_life_example": "If someone attacks you with a knife intending to kill you, you can use deadly force to stop them and it won't be considered murder.",
      "punishment": "No punishment - justified self-defense",
      "keywords": ["deadly force", "murder", "rape", "kidnapping", "grievous hurt", "Section 100"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_101",
      "title": "When Right of Private Defence of Body Extends to Causing Harm Other Than Death - Section 101 IPC",
      "section": "Section 101 IPC",
      "category": "Criminal Law",
      "text": "If the offence be not of any of the descriptions enumerated in the last preceding section, the right of private defence of the body does not extend to the voluntary causing of death to the assailant, but does extend, under the restrictions mentioned in Section 99, to the voluntary causing to the assailant of any harm other than death.",
      "simplified_summary": "For minor attacks, you can defend yourself but cannot cause death - only other harm like injury.",
      "real_life_example": "If someone punches you, you can punch back or restrain them, but you cannot kill them in response.",
      "punishment": "No punishment for reasonable defense",
      "keywords": ["minor attacks", "non-deadly force", "reasonable defense", "Section 101"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_102",
      "title": "Commencement and Continuance of Right of Private Defence of Body - Section 102 IPC",
      "section": "Section 102 IPC",
      "category": "Criminal Law",
      "text": "The right of private defence of the body commences as soon as a reasonable apprehension of danger to the body arises from an attempt or threat to commit the offence, though the offence may not have been committed; and it continues as long as such apprehension of danger to the body continues.",
      "simplified_summary": "Your right to defend yourself starts when you reasonably fear danger and continues as long as the threat exists.",
      "real_life_example": "If someone threatens to kill you and reaches for a weapon, you can defend yourself immediately, even before they actually attack.",
      "punishment": "No punishment - justified defense",
      "keywords": ["commencement", "reasonable apprehension", "threat", "danger", "Section 102"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_103",
      "title": "When Right of Private Defence of Property Extends to Causing Death - Section 103 IPC",
      "section": "Section 103 IPC",
      "category": "Criminal Law",
      "text": "The right of private defence of property extends, under the restrictions mentioned in Section 99, to the voluntary causing of death or of any other harm to the wrong-doer, if the offence, the committing of which, or the attempting to commit which, occasions the exercise of the right, be theft, mischief, or criminal trespass, of any of the descriptions hereinafter enumerated: (1) Robbery; (2) House-breaking by night; (3) Mischief by fire committed on any building, tent or vessel, which building, tent or vessel is used as a human dwelling, or as a place for the custody of property; (4) Theft, mischief, or house-trespass, under such circumstances as may reasonably cause apprehension that death or grievous hurt will be the consequence, if such right of private defence is not exercised.",
      "simplified_summary": "You can use deadly force to protect your property from serious crimes like robbery, house-breaking at night, or arson.",
      "real_life_example": "If someone breaks into your house at night to rob you, you can use deadly force to protect your home and family.",
      "punishment": "No punishment - justified property defense",
      "keywords": ["property defense", "robbery", "house-breaking", "arson", "theft", "Section 103"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_104",
      "title": "When Right of Private Defence of Property Extends to Causing Harm Other Than Death - Section 104 IPC",
      "section": "Section 104 IPC",
      "category": "Criminal Law",
      "text": "If the offence, the committing of which, or the attempting to commit which, occasions the exercise of the right of private defence, be theft, mischief, or criminal trespass, not of any of the descriptions enumerated in the last preceding section, that right does not extend to the voluntary causing of death, but does extend, subject to the restrictions mentioned in Section 99, to the voluntary causing to the wrong-doer of any harm other than death.",
      "simplified_summary": "For minor property crimes, you can defend your property but cannot cause death - only other harm like injury.",
      "real_life_example": "If someone tries to steal your bicycle, you can stop them and restrain them, but you cannot kill them for it.",
      "punishment": "No punishment for reasonable property defense",
      "keywords": ["minor property crimes", "theft", "mischief", "trespass", "non-deadly force", "Section 104"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_105",
      "title": "Commencement and Continuance of Right of Private Defence of Property - Section 105 IPC",
      "section": "Section 105 IPC",
      "category": "Criminal Law",
      "text": "The right of private defence of property commences when a reasonable apprehension of danger to the property commences. The right of private defence of property against theft continues till the offender has effected his retreat with the property or either has effected his retreat with the property or has been deprived of it, or has secured its possession by a private person. The right of private defence of property against robbery continues as long as the offender is in the act of committing the robbery or of carrying away or attempting to carry away property which he has taken. The right of private defence of property against criminal trespass or mischief continues as long as the offender continues in the commission of criminal trespass or mischief.",
      "simplified_summary": "Your right to defend property starts when you fear danger to it and continues until the threat is over or property is recovered.",
      "real_life_example": "If someone steals your phone, you can chase them and try to get it back until they escape or you recover it.",
      "punishment": "No punishment - justified property defense",
      "keywords": ["property defense", "theft", "robbery", "trespass", "mischief", "Section 105"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_106",
      "title": "Right of Private Defence Against Deadly Assault When There is Risk of Harm to Innocent Person - Section 106 IPC",
      "section": "Section 106 IPC",
      "category": "Criminal Law",
      "text": "If in the exercise of the right of private defence against an assault which reasonably causes the apprehension of death, the defender be so situated that he cannot effectually exercise that right without risk of harm to an innocent person, his right of private defence extends to the running of that risk.",
      "simplified_summary": "If you're defending yourself from a deadly attack but might accidentally harm an innocent person, you can still defend yourself.",
      "real_life_example": "If someone attacks you with a knife in a crowded area, you can still defend yourself even if there's a risk of accidentally hitting a bystander.",
      "punishment": "No punishment - justified defense with risk",
      "keywords": ["deadly assault", "innocent person", "risk", "justified defense", "Section 106"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_299",
      "title": "Culpable Homicide - Section 299 IPC",
      "section": "Section 299 IPC",
      "category": "Criminal Law",
      "text": "Whoever causes death by doing an act with the intention of causing death, or with the intention of causing such bodily injury as is likely to cause death, or with the knowledge that he is likely by such act to cause death, commits the offence of culpable homicide.",
      "simplified_summary": "Causing someone's death with intention or knowledge that it could cause death is culpable homicide (less serious than murder).",
      "real_life_example": "If you hit someone in a fight knowing they have a weak heart and they die, it's culpable homicide, not murder.",
      "punishment": "Imprisonment for life or up to 10 years and fine",
      "keywords": ["culpable homicide", "death", "intention", "bodily injury", "Section 299"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_300",
      "title": "Murder - Section 300 IPC",
      "section": "Section 300 IPC",
      "category": "Criminal Law",
      "text": "Except in the cases hereinafter excepted, culpable homicide is murder, if the act by which the death is caused is done with the intention of causing death, or if the bodily injury intended to be inflicted is sufficient in the ordinary course of nature to cause death, or if the person committing the act knows that it is so imminently dangerous that it must in all probability cause death or such bodily injury as is likely to cause death, and commits such act without any excuse for incurring the risk of causing death or such injury as aforesaid.",
      "simplified_summary": "Intentionally causing death or doing something so dangerous that death is almost certain is murder.",
      "real_life_example": "If you shoot someone in the head intending to kill them, or throw someone from a high building, it's murder.",
      "punishment": "Death penalty or imprisonment for life and fine",
      "keywords": ["murder", "intention", "death", "dangerous act", "Section 300"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_302",
      "title": "Punishment for Murder - Section 302 IPC",
      "section": "Section 302 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits murder shall be punished with death, or imprisonment for life, and shall also be liable to fine.",
      "simplified_summary": "Murder is punished with either death penalty or life imprisonment, plus a fine.",
      "real_life_example": "If someone is convicted of murder, they will either be hanged or spend the rest of their life in prison.",
      "punishment": "Death penalty or imprisonment for life and fine",
      "keywords": ["murder punishment", "death penalty", "life imprisonment", "fine", "Section 302"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_304",
      "title": "Punishment for Culpable Homicide Not Amounting to Murder - Section 304 IPC",
      "section": "Section 304 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits culpable homicide not amounting to murder shall be punished with imprisonment for life, or imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine, if the act by which the death is caused is done with the intention of causing death, or of causing such bodily injury as is likely to cause death; or with imprisonment of either description for a term which may extend to ten years, or with fine, or with both, if the act is done with the knowledge that it is likely to cause death, but without any intention to cause death, or to cause such bodily injury as is likely to cause death.",
      "simplified_summary": "Culpable homicide (less serious than murder) is punished with up to life imprisonment or 10 years, depending on intention.",
      "real_life_example": "If you cause someone's death without intending to kill them, you might get 10 years in prison instead of life.",
      "punishment": "Life imprisonment or up to 10 years and fine",
      "keywords": ["culpable homicide", "imprisonment", "intention", "knowledge", "Section 304"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_307",
      "title": "Attempt to Murder - Section 307 IPC",
      "section": "Section 307 IPC",
      "category": "Criminal Law",
      "text": "Whoever does any act with such intention or knowledge and under such circumstances that, if he by that act caused death, he would be guilty of murder, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine; and if hurt is caused to any person by such act, the offender shall be liable either to imprisonment for life, or to such punishment as is hereinbefore mentioned.",
      "simplified_summary": "Trying to kill someone but failing is attempt to murder, punished with up to 10 years or life if injury is caused.",
      "real_life_example": "If you shoot at someone intending to kill them but miss, you can still be charged with attempt to murder.",
      "punishment": "Up to 10 years imprisonment and fine, or life if injury caused",
      "keywords": ["attempt to murder", "intention", "knowledge", "imprisonment", "Section 307"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_308",
      "title": "Attempt to Commit Culpable Homicide - Section 308 IPC",
      "section": "Section 308 IPC",
      "category": "Criminal Law",
      "text": "Whoever does any act with such intention or knowledge and under such circumstances that, if he by that act caused death, he would be guilty of culpable homicide not amounting to murder, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both; and if hurt is caused to any person by such act, the offender shall be liable to imprisonment of either description for a term which may extend to seven years, or shall be liable to fine, or to both.",
      "simplified_summary": "Trying to cause death without murderous intent is attempt to culpable homicide, punished with up to 3-7 years.",
      "real_life_example": "If you hit someone knowing they might die but not intending to kill them, it's attempt to culpable homicide.",
      "punishment": "Up to 3 years imprisonment and fine, or up to 7 years if injury caused",
      "keywords": ["attempt culpable homicide", "intention", "knowledge", "imprisonment", "Section 308"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_309",
      "title": "Attempt to Commit Suicide - Section 309 IPC",
      "section": "Section 309 IPC",
      "category": "Criminal Law",
      "text": "Whoever attempts to commit suicide and does any act towards the commission of such offence, shall be punished with simple imprisonment for a term which may extend to one year, or with fine, or with both.",
      "simplified_summary": "Attempting suicide is a crime punishable with up to 1 year in prison or fine (though rarely enforced).",
      "real_life_example": "If someone tries to kill themselves and fails, they can technically be charged with a crime, though this is rarely done.",
      "punishment": "Up to 1 year simple imprisonment or fine",
      "keywords": ["suicide attempt", "imprisonment", "fine", "mental health", "Section 309"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_310",
      "title": "Thug - Section 310 IPC",
      "section": "Section 310 IPC",
      "category": "Criminal Law",
      "text": "Whoever, at any time after the passing of this Act, shall have been habitually associated with any other or others for the purpose of committing robbery or child-stealing by means of or accompanied by murder, is a thug.",
      "simplified_summary": "A thug is someone who habitually commits robbery or child-stealing by murder as part of a group.",
      "real_life_example": "Members of organized crime groups who regularly rob and kill people are considered thugs.",
      "punishment": "Imprisonment for life and fine",
      "keywords": ["thug", "robbery", "child-stealing", "murder", "organized crime", "Section 310"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_311",
      "title": "Punishment for Thug - Section 311 IPC",
      "section": "Section 311 IPC",
      "category": "Criminal Law",
      "text": "Whoever is a thug, shall be punished with imprisonment for life, and shall also be liable to fine.",
      "simplified_summary": "Being a thug is punished with life imprisonment and fine.",
      "real_life_example": "If someone is convicted of being a thug, they will spend the rest of their life in prison.",
      "punishment": "Imprisonment for life and fine",
      "keywords": ["thug punishment", "life imprisonment", "fine", "organized crime", "Section 311"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_312",
      "title": "Causing Miscarriage - Section 312 IPC",
      "section": "Section 312 IPC",
      "category": "Criminal Law",
      "text": "Whoever voluntarily causes a woman with child to miscarry, shall, if such miscarriage be not caused in good faith for the purpose of saving the life of the woman, be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both; and, if the woman be quick with child, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
      "simplified_summary": "Causing abortion is illegal unless done to save the woman's life, punished with up to 3-7 years in prison.",
      "real_life_example": "If someone forces a pregnant woman to have an abortion against her will, they can be jailed for up to 7 years.",
      "punishment": "Up to 3 years imprisonment and fine, or up to 7 years if woman is quick with child",
      "keywords": ["miscarriage", "abortion", "pregnancy", "imprisonment", "Section 312"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_313",
      "title": "Causing Miscarriage Without Woman's Consent - Section 313 IPC",
      "section": "Section 313 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits the offence defined in the last preceding section without the consent of the woman, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Forcing abortion without the woman's consent is punished with up to life imprisonment.",
      "real_life_example": "If someone forces a woman to have an abortion against her will, they can be jailed for life.",
      "punishment": "Life imprisonment or up to 10 years and fine",
      "keywords": ["forced abortion", "without consent", "life imprisonment", "woman's rights", "Section 313"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_314",
      "title": "Death Caused by Act Done with Intent to Cause Miscarriage - Section 314 IPC",
      "section": "Section 314 IPC",
      "category": "Criminal Law",
      "text": "Whoever, with intent to cause the miscarriage of a woman with child, does any act which causes the death of such woman, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine; and if the act is done without the consent of the woman, shall be punished either with imprisonment for life, or with the punishment above mentioned.",
      "simplified_summary": "If someone causes a woman's death while trying to cause abortion, they can be jailed for up to 10 years or life.",
      "real_life_example": "If someone performs an unsafe abortion that kills the woman, they can be charged with causing death and jailed for life.",
      "punishment": "Up to 10 years imprisonment and fine, or life if without consent",
      "keywords": ["abortion death", "unsafe abortion", "imprisonment", "woman's death", "Section 314"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_315",
      "title": "Act Done with Intent to Prevent Child Being Born Alive or to Cause It to Die After Birth - Section 315 IPC",
      "section": "Section 315 IPC",
      "category": "Criminal Law",
      "text": "Whoever before the birth of any child does any act with the intention of preventing that child from being born alive or causing it to die after its birth, and does by such act prevent that child from being born alive, or causes it to die after its birth, shall, if such act be not caused in good faith for the purpose of saving the life of the mother, be punished with imprisonment of either description for a term which may extend to ten years, or with fine, or with both.",
      "simplified_summary": "Intentionally preventing a child from being born alive or causing it to die after birth is illegal unless to save the mother's life.",
      "real_life_example": "If someone intentionally causes a baby to die during birth or right after, they can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["infanticide", "child death", "birth", "imprisonment", "Section 315"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_316",
      "title": "Causing Death of Quick Unborn Child by Act Amounting to Culpable Homicide - Section 316 IPC",
      "section": "Section 316 IPC",
      "category": "Criminal Law",
      "text": "Whoever does any act under such circumstances, that if he thereby caused death he would be guilty of culpable homicide, and does by such act cause the death of a quick unborn child, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Causing the death of an unborn child (quick with child) through actions that would be culpable homicide is illegal.",
      "real_life_example": "If someone attacks a pregnant woman and causes the death of her unborn child, they can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["unborn child", "culpable homicide", "pregnancy", "imprisonment", "Section 316"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_317",
      "title": "Exposure and Abandonment of Child Under Twelve Years by Parent or Person Having Care of It - Section 317 IPC",
      "section": "Section 317 IPC",
      "category": "Criminal Law",
      "text": "Whoever being the father or mother of a child under the age of twelve years, or having the care of such child, shall expose or leave such child in any place with the intention of wholly abandoning such child, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both.",
      "simplified_summary": "Abandoning a child under 12 years old is illegal and punished with up to 7 years in prison.",
      "real_life_example": "If parents leave their 5-year-old child alone in a public place intending to abandon them, they can be jailed for up to 7 years.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["child abandonment", "exposure", "parent", "imprisonment", "Section 317"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_318",
      "title": "Concealment of Birth by Secret Disposal of Dead Body - Section 318 IPC",
      "section": "Section 318 IPC",
      "category": "Criminal Law",
      "text": "Whoever, by secretly burying or otherwise disposing of the dead body of a child, whether such child died before or after or during its birth, intentionally conceals or endeavours to conceal the birth of such child, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
      "simplified_summary": "Secretly disposing of a dead child's body to hide the birth is illegal and punished with up to 2 years in prison.",
      "real_life_example": "If someone secretly buries a stillborn baby to hide the pregnancy, they can be jailed for up to 2 years.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["concealment of birth", "dead body", "secret disposal", "imprisonment", "Section 318"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_319",
      "title": "Hurt - Section 319 IPC",
      "section": "Section 319 IPC",
      "category": "Criminal Law",
      "text": "Whoever causes bodily pain, disease or infirmity to any person is said to cause hurt.",
      "simplified_summary": "Causing physical pain, disease, or weakness to someone is called hurt.",
      "real_life_example": "If you punch someone and they feel pain, you have caused hurt to them.",
      "punishment": "Depends on type of hurt caused",
      "keywords": ["hurt", "bodily pain", "disease", "infirmity", "Section 319"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_320",
      "title": "Grievous Hurt - Section 320 IPC",
      "section": "Section 320 IPC",
      "category": "Criminal Law",
      "text": "The following kinds of hurt only are designated as 'grievous': (1) Emasculation; (2) Permanent privation of the sight of either eye; (3) Permanent privation of the hearing of either ear; (4) Privation of any member or joint of the body; (5) Destruction or permanent impairing of the powers of any member or joint of the body; (6) Permanent disfiguration of the head or face; (7) Fracture or dislocation of a bone or tooth; (8) Any hurt which endangers life or which causes the sufferer, during the space of twenty days, to be unable to follow his ordinary pursuits.",
      "simplified_summary": "Grievous hurt includes serious injuries like losing an eye, breaking bones, permanent disfigurement, or injuries that endanger life.",
      "real_life_example": "If you hit someone so hard that they lose an eye or break their arm, it's grievous hurt.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["grievous hurt", "serious injury", "permanent damage", "fracture", "Section 320"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_321",
      "title": "Voluntarily Causing Hurt - Section 321 IPC",
      "section": "Section 321 IPC",
      "category": "Criminal Law",
      "text": "Whoever does any act with the intention of thereby causing hurt to any person, or with the knowledge that he is likely thereby to cause hurt to any person, and does thereby cause hurt to any person, is said 'voluntarily to cause hurt'.",
      "simplified_summary": "Intentionally or knowingly causing hurt to someone is called voluntarily causing hurt.",
      "real_life_example": "If you intentionally hit someone knowing it will hurt them, you have voluntarily caused hurt.",
      "punishment": "Up to 1 year imprisonment and fine",
      "keywords": ["voluntarily causing hurt", "intention", "knowledge", "imprisonment", "Section 321"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_322",
      "title": "Voluntarily Causing Grievous Hurt - Section 322 IPC",
      "section": "Section 322 IPC",
      "category": "Criminal Law",
      "text": "Whoever voluntarily causes hurt, if the hurt which he intends to cause or knows himself to be likely to cause is grievous hurt, and if the hurt which he causes is grievous hurt, is said 'voluntarily to cause grievous hurt'.",
      "simplified_summary": "Intentionally or knowingly causing grievous hurt (serious injury) to someone is called voluntarily causing grievous hurt.",
      "real_life_example": "If you intentionally hit someone hard enough to break their bone, you have voluntarily caused grievous hurt.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["voluntarily causing grievous hurt", "serious injury", "intention", "imprisonment", "Section 322"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_323",
      "title": "Punishment for Voluntarily Causing Hurt - Section 323 IPC",
      "section": "Section 323 IPC",
      "category": "Criminal Law",
      "text": "Whoever, except in the case provided for by Section 334, voluntarily causes hurt, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to one thousand rupees, or with both.",
      "simplified_summary": "Voluntarily causing hurt is punished with up to 1 year in prison or fine of up to 1000 rupees.",
      "real_life_example": "If you punch someone and cause them pain, you can be jailed for up to 1 year or fined 1000 rupees.",
      "punishment": "Up to 1 year imprisonment and fine up to 1000 rupees",
      "keywords": ["hurt punishment", "imprisonment", "fine", "1000 rupees", "Section 323"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_324",
      "title": "Voluntarily Causing Hurt by Dangerous Weapons or Means - Section 324 IPC",
      "section": "Section 324 IPC",
      "category": "Criminal Law",
      "text": "Whoever, except in the case provided for by Section 334, voluntarily causes hurt by means of any instrument for shooting, stabbing or cutting, or any instrument which, used as a weapon of offence, is likely to cause death, or by means of fire or any heated substance, or by means of any poison or any corrosive substance, or by means of any explosive substance, or by means of any substance which it is deleterious to the human body to inhale, to swallow, or to receive into the blood, or by means of any animal, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
      "simplified_summary": "Causing hurt with dangerous weapons like knives, guns, fire, poison, or animals is punished more severely - up to 3 years in prison.",
      "real_life_example": "If you cut someone with a knife or burn them with fire, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["dangerous weapons", "knife", "gun", "fire", "poison", "Section 324"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_325",
      "title": "Punishment for Voluntarily Causing Grievous Hurt - Section 325 IPC",
      "section": "Section 325 IPC",
      "category": "Criminal Law",
      "text": "Whoever, except in the case provided for by Section 335, voluntarily causes grievous hurt, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
      "simplified_summary": "Voluntarily causing grievous hurt (serious injury) is punished with up to 7 years in prison and fine.",
      "real_life_example": "If you break someone's arm or cause them to lose an eye, you can be jailed for up to 7 years.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["grievous hurt punishment", "serious injury", "imprisonment", "fine", "Section 325"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_326",
      "title": "Voluntarily Causing Grievous Hurt by Dangerous Weapons or Means - Section 326 IPC",
      "section": "Section 326 IPC",
      "category": "Criminal Law",
      "text": "Whoever, except in the case provided for by Section 335, voluntarily causes grievous hurt by means of any instrument for shooting, stabbing or cutting, or any instrument which, used as a weapon of offence, is likely to cause death, or by means of fire or any heated substance, or by means of any poison or any corrosive substance, or by means of any explosive substance, or by means of any substance which it is deleterious to the human body to inhale, to swallow, or to receive into the blood, or by means of any animal, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Causing grievous hurt with dangerous weapons like knives, guns, fire, or poison is punished with up to 10 years in prison.",
      "real_life_example": "If you cut someone so badly with a knife that they lose a limb, you can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["grievous hurt with weapons", "dangerous weapons", "serious injury", "imprisonment", "Section 326"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_327",
      "title": "Voluntarily Causing Hurt to Extort Property or to Constrain to an Illegal Act - Section 327 IPC",
      "section": "Section 327 IPC",
      "category": "Criminal Law",
      "text": "Whoever voluntarily causes hurt, for the purpose of extorting from the sufferer or from any person interested in the sufferer any property or valuable security, or of constraining the sufferer or any person interested in the sufferer to do anything which is illegal or which may facilitate the commission of an offence, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Causing hurt to extort money or force someone to do something illegal is punished with up to 10 years in prison.",
      "real_life_example": "If you beat someone to force them to give you money or commit a crime, you can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["extortion", "hurt for property", "illegal act", "imprisonment", "Section 327"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_328",
      "title": "Voluntarily Causing Hurt by Means of Poison - Section 328 IPC",
      "section": "Section 328 IPC",
      "category": "Criminal Law",
      "text": "Whoever administers to or causes to be taken by any person any poison or any stupefying, intoxicating or unwholesome drug, or other thing with intent to cause hurt to such person, or with intent to commit or to facilitate the commission of an offence or knowing it to be likely that he will thereby cause hurt, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Giving someone poison or drugs to hurt them or commit a crime is punished with up to 10 years in prison.",
      "real_life_example": "If you put poison in someone's food to hurt them or make them unconscious, you can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["poison", "drugs", "stupefying", "intoxication", "Section 328"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_329",
      "title": "Voluntarily Causing Grievous Hurt by Means of Poison - Section 329 IPC",
      "section": "Section 329 IPC",
      "category": "Criminal Law",
      "text": "Whoever administers to or causes to be taken by any person any poison or any stupefying, intoxicating or unwholesome drug, or other thing with intent to cause grievous hurt to such person, or with intent to commit or to facilitate the commission of an offence or knowing it to be likely that he will thereby cause grievous hurt, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Giving someone poison or drugs to cause serious injury is punished with up to 10 years in prison.",
      "real_life_example": "If you poison someone intending to cause serious harm, you can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["poison grievous hurt", "serious injury", "drugs", "imprisonment", "Section 329"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_330",
      "title": "Voluntarily Causing Hurt to Extort Confession or to Compel Restoration of Property - Section 330 IPC",
      "section": "Section 330 IPC",
      "category": "Criminal Law",
      "text": "Whoever voluntarily causes hurt, for the purpose of extorting from the sufferer or from any person interested in the sufferer any confession or any information which may lead to the detection of an offence or misconduct, or for the purpose of constraining the sufferer or any person interested in the sufferer to restore or to cause the restoration of any property or valuable security or to satisfy any claim or demand, or to give information which may lead to the restoration of any property or valuable security, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
      "simplified_summary": "Causing hurt to force a confession or get back stolen property is punished with up to 7 years in prison.",
      "real_life_example": "If you beat someone to force them to confess to a crime or return stolen money, you can be jailed for up to 7 years.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["extort confession", "restore property", "torture", "imprisonment", "Section 330"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_331",
      "title": "Voluntarily Causing Grievous Hurt to Extort Confession or to Compel Restoration of Property - Section 331 IPC",
      "section": "Section 331 IPC",
      "category": "Criminal Law",
      "text": "Whoever voluntarily causes grievous hurt, for the purpose of extorting from the sufferer or from any person interested in the sufferer any confession or any information which may lead to the detection of an offence or misconduct, or for the purpose of constraining the sufferer or any person interested in the sufferer to restore or to cause the restoration of any property or valuable security or to satisfy any claim or demand, or to give information which may lead to the restoration of any property or valuable security, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Causing serious injury to force a confession or get back stolen property is punished with up to 10 years in prison.",
      "real_life_example": "If you torture someone severely to force them to confess or return stolen goods, you can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["grievous hurt confession", "torture", "serious injury", "imprisonment", "Section 331"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_332",
      "title": "Voluntarily Causing Hurt to Deter Public Servant from His Duty - Section 332 IPC",
      "section": "Section 332 IPC",
      "category": "Criminal Law",
      "text": "Whoever voluntarily causes hurt to any person being a public servant in the discharge of his duty as such public servant, or with intent to prevent or deter that person from discharging his duty as such public servant, or in consequence of anything done or attempted to be done by that person in the lawful discharge of his duty as such public servant, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
      "simplified_summary": "Hurting a public servant (like police, judge, government official) while they're doing their job is punished with up to 3 years in prison.",
      "real_life_example": "If you hit a police officer while they're arresting someone, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["public servant", "police", "government official", "duty", "Section 332"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_333",
      "title": "Voluntarily Causing Grievous Hurt to Deter Public Servant from His Duty - Section 333 IPC",
      "section": "Section 333 IPC",
      "category": "Criminal Law",
      "text": "Whoever voluntarily causes grievous hurt to any person being a public servant in the discharge of his duty as such public servant, or with intent to prevent or deter that person from discharging his duty as such public servant, or in consequence of anything done or attempted to be done by that person in the lawful discharge of his duty as such public servant, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Causing serious injury to a public servant while they're doing their job is punished with up to 10 years in prison.",
      "real_life_example": "If you seriously injure a police officer while they're on duty, you can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["grievous hurt public servant", "serious injury", "police", "government", "Section 333"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_334",
      "title": "Voluntarily Causing Hurt on Provocation - Section 334 IPC",
      "section": "Section 334 IPC",
      "category": "Criminal Law",
      "text": "Whoever voluntarily causes hurt on grave and sudden provocation, if he neither intends nor knows himself to be likely to cause hurt to any person other than the person who gave the provocation, shall be punished with imprisonment of either description for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both.",
      "simplified_summary": "Causing hurt due to sudden provocation (without intending to hurt others) is punished with up to 1 month in prison or 500 rupees fine.",
      "real_life_example": "If someone insults you suddenly and you hit them in anger, you might get a lighter punishment of 1 month or 500 rupees fine.",
      "punishment": "Up to 1 month imprisonment and fine up to 500 rupees",
      "keywords": ["provocation", "sudden provocation", "anger", "lighter punishment", "Section 334"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_335",
      "title": "Voluntarily Causing Grievous Hurt on Provocation - Section 335 IPC",
      "section": "Section 335 IPC",
      "category": "Criminal Law",
      "text": "Whoever voluntarily causes grievous hurt on grave and sudden provocation, if he neither intends nor knows himself to be likely to cause grievous hurt to any person other than the person who gave the provocation, shall be punished with imprisonment of either description for a term which may extend to four years, or with fine which may extend to two thousand rupees, or with both.",
      "simplified_summary": "Causing serious injury due to sudden provocation (without intending to hurt others) is punished with up to 4 years in prison or 2000 rupees fine.",
      "real_life_example": "If someone provokes you suddenly and you cause serious injury in anger, you might get up to 4 years or 2000 rupees fine.",
      "punishment": "Up to 4 years imprisonment and fine up to 2000 rupees",
      "keywords": ["grievous hurt provocation", "serious injury", "anger", "imprisonment", "Section 335"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_336",
      "title": "Act Endangering Life or Personal Safety of Others - Section 336 IPC",
      "section": "Section 336 IPC",
      "category": "Criminal Law",
      "text": "Whoever does any act so rashly or negligently as to endanger human life or the personal safety of others, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to two hundred and fifty rupees, or with both.",
      "simplified_summary": "Doing something carelessly that puts others' lives in danger is punished with up to 3 months in prison or 250 rupees fine.",
      "real_life_example": "If you drive recklessly and endanger other people's lives, you can be jailed for up to 3 months or fined 250 rupees.",
      "punishment": "Up to 3 months imprisonment and fine up to 250 rupees",
      "keywords": ["rash act", "negligence", "endanger life", "careless", "Section 336"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_337",
      "title": "Causing Hurt by Act Endangering Life or Personal Safety of Others - Section 337 IPC",
      "section": "Section 337 IPC",
      "category": "Criminal Law",
      "text": "Whoever causes hurt to any person by doing any act so rashly or negligently as to endanger human life or the personal safety of others, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five hundred rupees, or with both.",
      "simplified_summary": "Causing hurt to someone by doing something carelessly that endangers lives is punished with up to 6 months in prison or 500 rupees fine.",
      "real_life_example": "If you drive carelessly and hit someone, causing them injury, you can be jailed for up to 6 months or fined 500 rupees.",
      "punishment": "Up to 6 months imprisonment and fine up to 500 rupees",
      "keywords": ["hurt by rash act", "negligence", "injury", "careless driving", "Section 337"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_338",
      "title": "Causing Grievous Hurt by Act Endangering Life or Personal Safety of Others - Section 338 IPC",
      "section": "Section 338 IPC",
      "category": "Criminal Law",
      "text": "Whoever causes grievous hurt to any person by doing any act so rashly or negligently as to endanger human life or the personal safety of others, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine which may extend to one thousand rupees, or with both.",
      "simplified_summary": "Causing serious injury to someone by doing something carelessly that endangers lives is punished with up to 2 years in prison or 1000 rupees fine.",
      "real_life_example": "If you drive carelessly and cause someone serious injury, you can be jailed for up to 2 years or fined 1000 rupees.",
      "punishment": "Up to 2 years imprisonment and fine up to 1000 rupees",
      "keywords": ["grievous hurt by rash act", "serious injury", "negligence", "careless", "Section 338"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_339",
      "title": "Wrongful Restraint - Section 339 IPC",
      "section": "Section 339 IPC",
      "category": "Criminal Law",
      "text": "Whoever voluntarily obstructs any person so as to prevent that person from proceeding in any direction in which that person has a right to proceed, is said wrongfully to restrain that person.",
      "simplified_summary": "Preventing someone from going where they have a right to go is called wrongful restraint.",
      "real_life_example": "If you block someone's path and prevent them from walking forward, you have wrongfully restrained them.",
      "punishment": "Up to 1 month imprisonment and fine up to 500 rupees",
      "keywords": ["wrongful restraint", "obstruction", "prevent movement", "blocking", "Section 339"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_340",
      "title": "Wrongful Confinement - Section 340 IPC",
      "section": "Section 340 IPC",
      "category": "Criminal Law",
      "text": "Whoever wrongfully restrains any person in such a manner as to prevent that person from proceeding beyond certain circumscribing limits, is said 'wrongfully to confine' that person.",
      "simplified_summary": "Keeping someone within certain limits and preventing them from leaving is called wrongful confinement.",
      "real_life_example": "If you lock someone in a room and prevent them from leaving, you have wrongfully confined them.",
      "punishment": "Up to 1 year imprisonment and fine up to 1000 rupees",
      "keywords": ["wrongful confinement", "restrain", "prevent leaving", "lock up", "Section 340"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_341",
      "title": "Punishment for Wrongful Restraint - Section 341 IPC",
      "section": "Section 341 IPC",
      "category": "Criminal Law",
      "text": "Whoever wrongfully restrains any person shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five hundred rupees, or with both.",
      "simplified_summary": "Wrongful restraint is punished with up to 1 month in prison or 500 rupees fine.",
      "real_life_example": "If you block someone's path and prevent them from moving, you can be jailed for up to 1 month or fined 500 rupees.",
      "punishment": "Up to 1 month imprisonment and fine up to 500 rupees",
      "keywords": ["wrongful restraint punishment", "imprisonment", "fine", "500 rupees", "Section 341"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_342",
      "title": "Punishment for Wrongful Confinement - Section 342 IPC",
      "section": "Section 342 IPC",
      "category": "Criminal Law",
      "text": "Whoever wrongfully confines any person shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to one thousand rupees, or with both.",
      "simplified_summary": "Wrongful confinement is punished with up to 1 year in prison or 1000 rupees fine.",
      "real_life_example": "If you lock someone up and prevent them from leaving, you can be jailed for up to 1 year or fined 1000 rupees.",
      "punishment": "Up to 1 year imprisonment and fine up to 1000 rupees",
      "keywords": ["wrongful confinement punishment", "imprisonment", "fine", "1000 rupees", "Section 342"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_343",
      "title": "Wrongful Confinement for Three or More Days - Section 343 IPC",
      "section": "Section 343 IPC",
      "category": "Criminal Law",
      "text": "Whoever wrongfully confines any person for three days or more, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
      "simplified_summary": "Wrongfully confining someone for 3 or more days is punished with up to 2 years in prison and fine.",
      "real_life_example": "If you lock someone up for 3 days or more, you can be jailed for up to 2 years.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["wrongful confinement 3 days", "extended confinement", "imprisonment", "Section 343"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_344",
      "title": "Wrongful Confinement for Ten or More Days - Section 344 IPC",
      "section": "Section 344 IPC",
      "category": "Criminal Law",
      "text": "Whoever wrongfully confines any person for ten days or more, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.",
      "simplified_summary": "Wrongfully confining someone for 10 or more days is punished with up to 3 years in prison and fine.",
      "real_life_example": "If you lock someone up for 10 days or more, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["wrongful confinement 10 days", "extended confinement", "imprisonment", "Section 344"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_345",
      "title": "Wrongful Confinement of Person for Whose Liberation Writ Has Been Issued - Section 345 IPC",
      "section": "Section 345 IPC",
      "category": "Criminal Law",
      "text": "Whoever keeps any person in wrongful confinement, knowing that a writ for the liberation of that person has been duly issued, shall be punished with imprisonment of either description for a term which may extend to two years, and shall also be liable to fine.",
      "simplified_summary": "Keeping someone in wrongful confinement even after a court orders their release is punished with up to 2 years in prison and fine.",
      "real_life_example": "If a court orders someone's release but you keep them locked up anyway, you can be jailed for up to 2 years.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["wrongful confinement writ", "court order", "liberation", "imprisonment", "Section 345"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_346",
      "title": "Wrongful Confinement in Secret - Section 346 IPC",
      "section": "Section 346 IPC",
      "category": "Criminal Law",
      "text": "Whoever wrongfully confines any person in such manner as to indicate an intention that the confinement of such person may not be known to any person interested in the person so confined, or to any public servant, or that the place of such confinement may not be known to or discovered by any such person or public servant as aforesaid, shall be punished with imprisonment of either description for a term which may extend to two years, in addition to any other punishment to which he may be liable for such wrongful confinement.",
      "simplified_summary": "Wrongfully confining someone in secret (so others can't find them) is punished with up to 2 years in prison, in addition to other punishments.",
      "real_life_example": "If you lock someone up in a hidden place so their family can't find them, you can be jailed for up to 2 years.",
      "punishment": "Up to 2 years imprisonment (in addition to other punishments)",
      "keywords": ["wrongful confinement secret", "hidden confinement", "imprisonment", "Section 346"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_347",
      "title": "Wrongful Confinement to Extort Property or to Constrain to Illegal Act - Section 347 IPC",
      "section": "Section 347 IPC",
      "category": "Criminal Law",
      "text": "Whoever wrongfully confines any person for the purpose of extorting from the person confined or from any person interested in the person confined any property or valuable security, or of constraining the person confined or any person interested in the person confined to do anything which is illegal or which may facilitate the commission of an offence, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.",
      "simplified_summary": "Wrongfully confining someone to extort money or force them to do something illegal is punished with up to 3 years in prison and fine.",
      "real_life_example": "If you lock someone up to force them to give you money or commit a crime, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["wrongful confinement extortion", "force illegal act", "imprisonment", "Section 347"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_348",
      "title": "Wrongful Confinement to Extort Confession or to Compel Restoration of Property - Section 348 IPC",
      "section": "Section 348 IPC",
      "category": "Criminal Law",
      "text": "Whoever wrongfully confines any person for the purpose of extorting from the person confined or from any person interested in the person confined any confession or any information which may lead to the detection of an offence or misconduct, or for the purpose of constraining the person confined or any person interested in the person confined to restore or to cause the restoration of any property or valuable security or to satisfy any claim or demand, or to give information which may lead to the restoration of any property or valuable security, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.",
      "simplified_summary": "Wrongfully confining someone to force a confession or get back stolen property is punished with up to 3 years in prison and fine.",
      "real_life_example": "If you lock someone up to force them to confess to a crime or return stolen goods, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["wrongful confinement confession", "extort confession", "restore property", "Section 348"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_349",
      "title": "Force - Section 349 IPC",
      "section": "Section 349 IPC",
      "category": "Criminal Law",
      "text": "A person is said to use force to another if he causes motion, change of motion, or cessation of motion to that other, or if he causes to any substance such motion or change of motion or cessation of motion as brings that substance into contact with any part of that other's body, or with anything which that other is wearing or carrying, or with anything so situated that such contact affects that other's sense of feeling: Provided that the person causing the motion, change of motion, or cessation of motion causes that motion, change of motion, or cessation of motion in one of the three ways hereinafter described: (1) By his own bodily power; (2) By disposing any substance in such a manner that the motion or change or cessation of motion takes place without any further act on his part or on the part of any other person; (3) By inducing any animal to move, to change its motion, or to cease to move.",
      "simplified_summary": "Force means causing any movement or change in movement to another person or their belongings, either directly or through objects or animals.",
      "real_life_example": "If you push someone, throw something at them, or make an animal attack them, you have used force against them.",
      "punishment": "Depends on the type of force used",
      "keywords": ["force", "motion", "movement", "bodily power", "Section 349"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_350",
      "title": "Criminal Force - Section 350 IPC",
      "section": "Section 350 IPC",
      "category": "Criminal Law",
      "text": "Whoever intentionally uses force to any person, without that person's consent, in order to the committing of any offence, or intending by the use of such force to cause, or knowing it to be likely that by the use of such force he will cause injury, fear or annoyance to the person to whom the force is used, is said to use criminal force to that other.",
      "simplified_summary": "Using force against someone without their consent to commit a crime or cause injury, fear, or annoyance is called criminal force.",
      "real_life_example": "If you push someone without their permission to scare them or steal from them, you have used criminal force.",
      "punishment": "Up to 3 months imprisonment and fine up to 500 rupees",
      "keywords": ["criminal force", "without consent", "injury", "fear", "annoyance", "Section 350"],
      "source": "Indian Penal Code"
        },
        {
          "id": "ipc_351",
          "title": "Assault - Section 351 IPC",
          "section": "Section 351 IPC",
          "category": "Criminal Law",
          "text": "Whoever makes any gesture, or any preparation intending or knowing it to be likely that such gesture or preparation will cause any person present to apprehend that he who makes that gesture or preparation is about to use criminal force to that person, is said to commit an assault.",
          "simplified_summary": "Making threatening gestures or preparations that make someone fear you will attack them is called assault.",
          "real_life_example": "If you raise your fist at someone in a threatening manner, making them fear you will hit them, you have committed assault.",
          "punishment": "Up to 3 months imprisonment and fine up to 500 rupees",
          "keywords": ["assault", "threatening gesture", "fear", "criminal force", "Section 351"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_352",
          "title": "Punishment for Assault or Criminal Force Otherwise Than on Grave Provocation - Section 352 IPC",
          "section": "Section 352 IPC",
          "category": "Criminal Law",
          "text": "Whoever assaults or uses criminal force to any person otherwise than on grave and sudden provocation given by that person, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to five hundred rupees, or with both.",
          "simplified_summary": "Assaulting or using criminal force against someone (except in response to serious provocation) is punished with up to 3 months in prison or 500 rupees fine.",
          "real_life_example": "If you hit someone without serious provocation, you can be jailed for up to 3 months or fined 500 rupees.",
          "punishment": "Up to 3 months imprisonment and fine up to 500 rupees",
          "keywords": ["assault punishment", "criminal force", "imprisonment", "fine", "Section 352"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_353",
          "title": "Assault or Criminal Force to Deter Public Servant from Discharge of His Duty - Section 353 IPC",
          "section": "Section 353 IPC",
          "category": "Criminal Law",
          "text": "Whoever assaults or uses criminal force to any person being a public servant in the execution of his duty as such public servant, or with intent to prevent or deter that person from discharging his duty as such public servant, or in consequence of anything done or attempted to be done by that person in the lawful discharge of his duty as such public servant, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
          "simplified_summary": "Assaulting or using force against a public servant while they're doing their job is punished with up to 2 years in prison and fine.",
          "real_life_example": "If you hit a police officer while they're arresting someone, you can be jailed for up to 2 years.",
          "punishment": "Up to 2 years imprisonment and fine",
          "keywords": ["assault public servant", "police", "government official", "duty", "Section 353"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_354",
          "title": "Assault or Criminal Force to Woman with Intent to Outrage Her Modesty - Section 354 IPC",
          "section": "Section 354 IPC",
          "category": "Criminal Law",
          "text": "Whoever assaults or uses criminal force to any woman, intending to outrage or knowing it to be likely that he will thereby outrage her modesty, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
          "simplified_summary": "Assaulting or using force against a woman to insult her modesty is punished with up to 2 years in prison and fine.",
          "real_life_example": "If you touch a woman inappropriately or make unwanted physical contact, you can be jailed for up to 2 years.",
          "punishment": "Up to 2 years imprisonment and fine",
          "keywords": ["assault woman", "outrage modesty", "sexual harassment", "imprisonment", "Section 354"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_354a",
          "title": "Sexual Harassment and Punishment for Sexual Harassment - Section 354A IPC",
          "section": "Section 354A IPC",
          "category": "Criminal Law",
          "text": "A man committing any of the following acts: (i) physical contact and advances involving unwelcome and explicit sexual overtures; or (ii) a demand or request for sexual favours; or (iii) showing pornography against the will of a woman; or (iv) making sexually coloured remarks, shall be guilty of the offence of sexual harassment.",
          "simplified_summary": "Sexual harassment includes unwanted physical contact, sexual demands, showing pornography, or making sexual comments against a woman's will.",
          "real_life_example": "If you make sexual comments to a female colleague or show her inappropriate pictures, you can be charged with sexual harassment.",
          "punishment": "Up to 3 years imprisonment and fine",
          "keywords": ["sexual harassment", "unwelcome advances", "sexual favours", "pornography", "Section 354A"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_354b",
          "title": "Assault or Use of Criminal Force to Woman with Intent to Disrobe - Section 354B IPC",
          "section": "Section 354B IPC",
          "category": "Criminal Law",
          "text": "Any man who assaults or uses criminal force to any woman or abets such act with the intention of disrobing or compelling her to be naked, shall be punished with imprisonment of either description for a term which shall not be less than three years but which may extend to seven years, and shall also be liable to fine.",
          "simplified_summary": "Forcing a woman to remove her clothes or making her naked against her will is punished with 3-7 years in prison and fine.",
          "real_life_example": "If you force a woman to remove her clothes against her will, you can be jailed for 3-7 years.",
          "punishment": "3-7 years imprisonment and fine",
          "keywords": ["disrobing", "compelling naked", "assault woman", "imprisonment", "Section 354B"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_354c",
          "title": "Voyeurism - Section 354C IPC",
          "section": "Section 354C IPC",
          "category": "Criminal Law",
          "text": "Any man who watches, or captures the image of a woman engaging in a private act in circumstances where she would usually have the expectation of not being observed either by the perpetrator or by any other person at the behest of the perpetrator or disseminates such image shall be punished.",
          "simplified_summary": "Watching or recording a woman in private without her consent (voyeurism) is a serious crime.",
          "real_life_example": "If you secretly record a woman changing clothes or using the bathroom, you can be charged with voyeurism.",
          "punishment": "1-3 years imprisonment and fine for first offence, 3-7 years for repeat offence",
          "keywords": ["voyeurism", "private act", "recording", "watching", "Section 354C"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_354d",
          "title": "Stalking - Section 354D IPC",
          "section": "Section 354D IPC",
          "category": "Criminal Law",
          "text": "Any man who follows a woman and contacts, or attempts to contact such woman to foster personal interaction repeatedly despite a clear indication of disinterest by such woman; or monitors the use by a woman of the internet, email or any other form of electronic communication, commits the offence of stalking.",
          "simplified_summary": "Following a woman or repeatedly contacting her despite her clear disinterest, or monitoring her online activities is called stalking.",
          "real_life_example": "If you keep following a woman home or repeatedly call her after she asks you to stop, you can be charged with stalking.",
          "punishment": "Up to 3 years imprisonment and fine for first offence, up to 5 years for repeat offence",
          "keywords": ["stalking", "following", "repeated contact", "monitoring", "Section 354D"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_355",
          "title": "Assault or Criminal Force with Intent to Dishonour Person - Section 355 IPC",
          "section": "Section 355 IPC",
          "category": "Criminal Law",
          "text": "Whoever assaults or uses criminal force to any person, intending thereby to dishonour that person, otherwise than on grave and sudden provocation given by that person, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
          "simplified_summary": "Assaulting someone to insult or dishonour them (except in response to serious provocation) is punished with up to 2 years in prison and fine.",
          "real_life_example": "If you slap someone in public to humiliate them, you can be jailed for up to 2 years.",
          "punishment": "Up to 2 years imprisonment and fine",
          "keywords": ["assault dishonour", "humiliation", "insult", "imprisonment", "Section 355"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_356",
          "title": "Assault or Criminal Force in Attempt to Commit Theft of Property Carried by a Person - Section 356 IPC",
          "section": "Section 356 IPC",
          "category": "Criminal Law",
          "text": "Whoever assaults or uses criminal force to any person, in attempting to commit theft of property which that person is then wearing or carrying, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
          "simplified_summary": "Using force to steal something someone is wearing or carrying is punished with up to 2 years in prison and fine.",
          "real_life_example": "If you snatch someone's phone or wallet from their hand using force, you can be jailed for up to 2 years.",
          "punishment": "Up to 2 years imprisonment and fine",
          "keywords": ["assault theft", "snatching", "property", "imprisonment", "Section 356"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_357",
          "title": "Assault or Criminal Force in Attempt Wrongfully to Confine a Person - Section 357 IPC",
          "section": "Section 357 IPC",
          "category": "Criminal Law",
          "text": "Whoever assaults or uses criminal force to any person, in attempting wrongfully to confine that person, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to one thousand rupees, or with both.",
          "simplified_summary": "Using force to try to wrongfully confine someone is punished with up to 1 year in prison or 1000 rupees fine.",
          "real_life_example": "If you try to force someone into a room against their will, you can be jailed for up to 1 year.",
          "punishment": "Up to 1 year imprisonment and fine up to 1000 rupees",
          "keywords": ["assault confinement", "wrongful confinement", "imprisonment", "Section 357"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_358",
          "title": "Assault or Criminal Force on Grave Provocation - Section 358 IPC",
          "section": "Section 358 IPC",
          "category": "Criminal Law",
          "text": "Whoever assaults or uses criminal force to any person on grave and sudden provocation given by that person, shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to two hundred rupees, or with both.",
          "simplified_summary": "Assaulting someone in response to serious provocation is punished with up to 1 month in prison or 200 rupees fine.",
          "real_life_example": "If someone seriously provokes you and you hit them in response, you might get a lighter punishment of 1 month or 200 rupees fine.",
          "punishment": "Up to 1 month imprisonment and fine up to 200 rupees",
          "keywords": ["assault provocation", "grave provocation", "lighter punishment", "Section 358"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_359",
          "title": "Kidnapping - Section 359 IPC",
          "section": "Section 359 IPC",
          "category": "Criminal Law",
          "text": "Kidnapping is of two kinds: kidnapping from India, and kidnapping from lawful guardianship.",
          "simplified_summary": "Kidnapping has two types: taking someone out of India, or taking someone away from their legal guardian.",
          "real_life_example": "If you take a child away from their parents without permission, or force someone to leave the country, it's kidnapping.",
          "punishment": "Depends on type of kidnapping",
          "keywords": ["kidnapping", "from India", "from guardianship", "abduction", "Section 359"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_360",
          "title": "Kidnapping from India - Section 360 IPC",
          "section": "Section 360 IPC",
          "category": "Criminal Law",
          "text": "Whoever conveys any person beyond the limits of India without the consent of that person, or of some person legally authorized to consent on behalf of that person, is said to kidnap that person from India.",
          "simplified_summary": "Taking someone out of India without their consent or their legal guardian's consent is kidnapping from India.",
          "real_life_example": "If you force someone to go to another country against their will, you have kidnapped them from India.",
          "punishment": "Up to 7 years imprisonment and fine",
          "keywords": ["kidnapping from India", "beyond limits", "without consent", "imprisonment", "Section 360"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_361",
          "title": "Kidnapping from Lawful Guardianship - Section 361 IPC",
          "section": "Section 361 IPC",
          "category": "Criminal Law",
          "text": "Whoever takes or entices any minor under sixteen years of age if a male, or under eighteen years of age if a female, or any person of unsound mind, out of the keeping of the lawful guardian of such minor or person of unsound mind, without the consent of such guardian, is said to kidnap such minor or person from lawful guardianship.",
          "simplified_summary": "Taking a minor (under 16 for boys, under 18 for girls) or mentally unsound person away from their legal guardian without consent is kidnapping.",
          "real_life_example": "If you take a 15-year-old boy or 17-year-old girl away from their parents without permission, it's kidnapping.",
          "punishment": "Up to 7 years imprisonment and fine",
          "keywords": ["kidnapping from guardianship", "minor", "unsound mind", "guardian", "Section 361"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_362",
          "title": "Abduction - Section 362 IPC",
          "section": "Section 362 IPC",
          "category": "Criminal Law",
          "text": "Whoever by force compels, or by any deceitful means induces, any person to go from any place, is said to abduct that person.",
          "simplified_summary": "Forcing or tricking someone to go somewhere against their will is called abduction.",
          "real_life_example": "If you trick someone into getting into your car by lying, or force them to come with you, it's abduction.",
          "punishment": "Depends on purpose of abduction",
          "keywords": ["abduction", "force", "deceitful means", "compel", "Section 362"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_363",
          "title": "Punishment for Kidnapping - Section 363 IPC",
          "section": "Section 363 IPC",
          "category": "Criminal Law",
          "text": "Whoever kidnaps any person from India or from lawful guardianship, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
          "simplified_summary": "Kidnapping is punished with up to 7 years in prison and fine.",
          "real_life_example": "If you kidnap someone, you can be jailed for up to 7 years.",
          "punishment": "Up to 7 years imprisonment and fine",
          "keywords": ["kidnapping punishment", "imprisonment", "fine", "7 years", "Section 363"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_363a",
          "title": "Kidnapping or Maiming a Minor for Purposes of Begging - Section 363A IPC",
          "section": "Section 363A IPC",
          "category": "Criminal Law",
          "text": "Whoever kidnaps any minor or, not being the lawful guardian of a minor, obtains the custody of the minor, in order that such minor may be employed or used for the purposes of begging shall be punished.",
          "simplified_summary": "Kidnapping a child to use them for begging is a serious crime with severe punishment.",
          "real_life_example": "If you take a child away from their family to force them to beg on the streets, you can be charged with this crime.",
          "punishment": "Up to 10 years imprisonment and fine",
          "keywords": ["kidnapping for begging", "minor", "begging", "imprisonment", "Section 363A"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_364",
          "title": "Kidnapping or Abducting in Order to Murder - Section 364 IPC",
          "section": "Section 364 IPC",
          "category": "Criminal Law",
          "text": "Whoever kidnaps or abducts any person in order that such person may be murdered or may be so disposed of as to be put in danger of being murdered, shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
          "simplified_summary": "Kidnapping someone to kill them or put them in danger of being killed is punished with life imprisonment or up to 10 years.",
          "real_life_example": "If you kidnap someone intending to kill them, you can be jailed for life or up to 10 years.",
          "punishment": "Life imprisonment or up to 10 years rigorous imprisonment and fine",
          "keywords": ["kidnapping to murder", "abduction to kill", "life imprisonment", "Section 364"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_365",
          "title": "Kidnapping or Abducting with Intent Secretly and Wrongfully to Confine Person - Section 365 IPC",
          "section": "Section 365 IPC",
          "category": "Criminal Law",
          "text": "Whoever kidnaps or abducts any person with intent to cause that person to be secretly and wrongfully confined, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
          "simplified_summary": "Kidnapping someone to secretly confine them is punished with up to 7 years in prison and fine.",
          "real_life_example": "If you kidnap someone to lock them up in a hidden place, you can be jailed for up to 7 years.",
          "punishment": "Up to 7 years imprisonment and fine",
          "keywords": ["kidnapping to confine", "secret confinement", "imprisonment", "Section 365"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_366",
          "title": "Kidnapping, Abducting or Inducing Woman to Compel Her Marriage - Section 366 IPC",
          "section": "Section 366 IPC",
          "category": "Criminal Law",
          "text": "Whoever kidnaps or abducts any woman with intent that she may be compelled, or knowing it to be likely that she will be compelled, to marry any person against her will, or in order that she may be forced or seduced to illicit intercourse, or knowing it to be likely that she will be forced or seduced to illicit intercourse, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
          "simplified_summary": "Kidnapping a woman to force her into marriage or sexual intercourse against her will is punished with up to 10 years in prison and fine.",
          "real_life_example": "If you kidnap a woman to force her to marry someone she doesn't want to marry, you can be jailed for up to 10 years.",
          "punishment": "Up to 10 years imprisonment and fine",
          "keywords": ["kidnapping woman", "forced marriage", "illicit intercourse", "imprisonment", "Section 366"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_366a",
          "title": "Procuration of Minor Girl - Section 366A IPC",
          "section": "Section 366A IPC",
          "category": "Criminal Law",
          "text": "Whoever, by any means whatsoever, induces any minor girl under the age of eighteen years to go from any place or to do any act with intent that such girl may be, or knowing that it is likely that such girl will be, forced or seduced to illicit intercourse with another person, shall be punished.",
          "simplified_summary": "Inducing a minor girl (under 18) to go somewhere or do something knowing she will be forced into sexual intercourse is a serious crime.",
          "real_life_example": "If you trick a 16-year-old girl into going somewhere knowing she will be forced into sexual activity, you can be charged with this crime.",
          "punishment": "Up to 10 years imprisonment and fine",
          "keywords": ["procuration minor girl", "under 18", "illicit intercourse", "imprisonment", "Section 366A"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_366b",
          "title": "Importation of Girl from Foreign Country - Section 366B IPC",
          "section": "Section 366B IPC",
          "category": "Criminal Law",
          "text": "Whoever imports into India from any country outside India any girl under the age of twenty-one years with intent that she may be, or knowing it to be likely that she will be, forced or seduced to illicit intercourse with another person, shall be punished.",
          "simplified_summary": "Bringing a girl under 21 from another country knowing she will be forced into sexual activity is a serious crime.",
          "real_life_example": "If you bring a 19-year-old girl from another country knowing she will be forced into prostitution, you can be charged with this crime.",
          "punishment": "Up to 10 years imprisonment and fine",
          "keywords": ["importation girl", "foreign country", "under 21", "illicit intercourse", "Section 366B"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_367",
          "title": "Kidnapping or Abducting in Order to Subject Person to Grievous Hurt - Section 367 IPC",
          "section": "Section 367 IPC",
          "category": "Criminal Law",
          "text": "Whoever kidnaps or abducts any person in order that such person may be subjected, or may be so disposed of as to be put in danger of being subjected to grievous hurt, or slavery, or to the unnatural lust of any person, or knowing it to be likely that such person will be so subjected or disposed of, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
          "simplified_summary": "Kidnapping someone to cause them serious injury, slavery, or sexual abuse is punished with up to 10 years in prison and fine.",
          "real_life_example": "If you kidnap someone to torture them or force them into slavery, you can be jailed for up to 10 years.",
          "punishment": "Up to 10 years imprisonment and fine",
          "keywords": ["kidnapping grievous hurt", "slavery", "unnatural lust", "imprisonment", "Section 367"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_368",
          "title": "Wrongfully Concealing or Keeping in Confinement Kidnapped or Abducted Person - Section 368 IPC",
          "section": "Section 368 IPC",
          "category": "Criminal Law",
          "text": "Whoever, knowing that any person has been kidnapped or has been abducted, wrongfully conceals or confines such person, shall be punished in the same manner as if he had kidnapped or abducted such person with the same intention or knowledge, or for the same purpose as that with or for which he conceals or detains such person.",
          "simplified_summary": "Hiding or confining someone you know has been kidnapped is punished the same as if you had kidnapped them yourself.",
          "real_life_example": "If you know someone has been kidnapped and you hide them in your house, you can be charged as if you kidnapped them yourself.",
          "punishment": "Same as kidnapping (up to 7 years imprisonment and fine)",
          "keywords": ["concealing kidnapped", "wrongful confinement", "same punishment", "Section 368"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_369",
          "title": "Kidnapping or Abducting Child Under Ten Years with Intent to Steal from Its Person - Section 369 IPC",
          "section": "Section 369 IPC",
          "category": "Criminal Law",
          "text": "Whoever kidnaps or abducts any child under the age of ten years with the intention of taking dishonestly any moveable property from the person of such child, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
          "simplified_summary": "Kidnapping a child under 10 to steal from them is punished with up to 7 years in prison and fine.",
          "real_life_example": "If you kidnap a 8-year-old child to steal their jewelry or money, you can be jailed for up to 7 years.",
          "punishment": "Up to 7 years imprisonment and fine",
          "keywords": ["kidnapping child under 10", "steal from child", "imprisonment", "Section 369"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_370",
          "title": "Buying or Disposing of Any Person as a Slave - Section 370 IPC",
          "section": "Section 370 IPC",
          "category": "Criminal Law",
          "text": "Whoever imports, exports, removes, buys, sells or disposes of any person as a slave, or accepts, receives or detains against his will any person as a slave, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
          "simplified_summary": "Buying, selling, or treating someone as a slave is punished with up to 7 years in prison and fine.",
          "real_life_example": "If you buy or sell a person as a slave, or force someone to work as your slave, you can be jailed for up to 7 years.",
          "punishment": "Up to 7 years imprisonment and fine",
          "keywords": ["slavery", "buying person", "selling person", "imprisonment", "Section 370"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_370a",
          "title": "Exploitation of Trafficked Person - Section 370A IPC",
          "section": "Section 370A IPC",
          "category": "Criminal Law",
          "text": "Whoever, knowingly or having reason to believe that a person has been trafficked, engages such person for sexual exploitation or forced labour, shall be punished with rigorous imprisonment for a term which shall not be less than three years, but which may extend to five years, and shall also be liable to fine.",
          "simplified_summary": "Using a trafficked person for sexual exploitation or forced labor is punished with 3-5 years rigorous imprisonment and fine.",
          "real_life_example": "If you know someone has been trafficked and you force them to work or engage in sexual activities, you can be jailed for 3-5 years.",
          "punishment": "3-5 years rigorous imprisonment and fine",
          "keywords": ["exploitation trafficked person", "sexual exploitation", "forced labour", "imprisonment", "Section 370A"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_371",
          "title": "Habitual Dealing in Slaves - Section 371 IPC",
          "section": "Section 371 IPC",
          "category": "Criminal Law",
          "text": "Whoever habitually imports, exports, removes, buys, sells, traffics or deals in slaves, shall be punished with imprisonment for life, or with imprisonment of either description for a term not exceeding ten years, and shall also be liable to fine.",
          "simplified_summary": "Regularly dealing in slaves (human trafficking) is punished with life imprisonment or up to 10 years and fine.",
          "real_life_example": "If you regularly buy and sell people as slaves, you can be jailed for life or up to 10 years.",
          "punishment": "Life imprisonment or up to 10 years imprisonment and fine",
          "keywords": ["habitual dealing slaves", "human trafficking", "life imprisonment", "Section 371"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_372",
          "title": "Selling Minors for Prostitution - Section 372 IPC",
          "section": "Section 372 IPC",
          "category": "Criminal Law",
          "text": "Whoever sells, lets to hire, or otherwise disposes of any person under the age of eighteen years with intent that such person shall at any age be employed or used for the purpose of prostitution or illicit intercourse with any person or for any unlawful and immoral purpose, shall be punished.",
          "simplified_summary": "Selling or hiring out a minor (under 18) for prostitution or sexual activities is a serious crime.",
          "real_life_example": "If you sell a 16-year-old girl to someone for prostitution, you can be charged with this serious crime.",
          "punishment": "Up to 10 years imprisonment and fine",
          "keywords": ["selling minor prostitution", "under 18", "illicit intercourse", "imprisonment", "Section 372"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_373",
          "title": "Buying Minors for Prostitution - Section 373 IPC",
          "section": "Section 373 IPC",
          "category": "Criminal Law",
          "text": "Whoever buys, hires or otherwise obtains possession of any person under the age of eighteen years with intent that such person shall at any age be employed or used for the purpose of prostitution or illicit intercourse with any person or for any unlawful and immoral purpose, shall be punished.",
          "simplified_summary": "Buying or hiring a minor (under 18) for prostitution or sexual activities is a serious crime.",
          "real_life_example": "If you buy a 17-year-old boy or girl for sexual activities, you can be charged with this serious crime.",
          "punishment": "Up to 10 years imprisonment and fine",
          "keywords": ["buying minor prostitution", "under 18", "illicit intercourse", "imprisonment", "Section 373"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_374",
          "title": "Unlawful Compulsory Labour - Section 374 IPC",
          "section": "Section 374 IPC",
          "category": "Criminal Law",
          "text": "Whoever unlawfully compels any person to labour against the will of that person, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.",
          "simplified_summary": "Forcing someone to work against their will is punished with up to 1 year in prison and fine.",
          "real_life_example": "If you force someone to work for you without paying them or against their will, you can be jailed for up to 1 year.",
          "punishment": "Up to 1 year imprisonment and fine",
          "keywords": ["unlawful compulsory labour", "force to work", "against will", "imprisonment", "Section 374"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_375",
          "title": "Rape - Section 375 IPC",
          "section": "Section 375 IPC",
          "category": "Criminal Law",
          "text": "A man is said to commit 'rape' if he: (a) penetrates his penis, to any extent, into the vagina, mouth, urethra or anus of a woman or makes her to do so with him or any other person; or (b) inserts, to any extent, any object or a part of the body, not being the penis, into the vagina, the urethra or anus of a woman or makes her to do so with him or any other person; or (c) manipulates any part of the body of a woman so as to cause penetration into the vagina, urethra or anus of a woman or makes her to do so with him or any other person; or (d) applies his mouth to the vagina, urethra or anus of a woman or makes her to do so with him or any other person, under the circumstances falling under any of the following seven descriptions.",
          "simplified_summary": "Rape includes various forms of sexual penetration without consent, including with objects or body parts other than penis.",
          "real_life_example": "If you force any form of sexual penetration on a woman without her consent, it is rape.",
          "punishment": "Imprisonment for not less than 7 years but which may extend to life imprisonment and fine",
          "keywords": ["rape", "sexual penetration", "without consent", "life imprisonment", "Section 375"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_376",
          "title": "Punishment for Rape - Section 376 IPC",
          "section": "Section 376 IPC",
          "category": "Criminal Law",
          "text": "Whoever commits rape shall be punished with rigorous imprisonment of either description for a term which shall not be less than seven years, but which may extend to imprisonment for life, and shall also be liable to fine.",
          "simplified_summary": "Rape is punished with at least 7 years rigorous imprisonment, which may extend to life imprisonment, and fine.",
          "real_life_example": "If you are convicted of rape, you will be jailed for at least 7 years and possibly for life.",
          "punishment": "Not less than 7 years rigorous imprisonment, may extend to life imprisonment and fine",
          "keywords": ["rape punishment", "rigorous imprisonment", "7 years minimum", "life imprisonment", "Section 376"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_376a",
          "title": "Punishment for Causing Death or Resulting in Persistent Vegetative State of Victim - Section 376A IPC",
          "section": "Section 376A IPC",
          "category": "Criminal Law",
          "text": "Whoever commits an offence punishable under sub-section (1) or sub-section (2) of section 376 and in the course of such commission inflicts an injury which causes the death of the person or causes the person to be in a persistent vegetative state, shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person's natural life, or with death.",
          "simplified_summary": "If rape causes the victim's death or puts them in a vegetative state, the punishment is at least 20 years imprisonment, life imprisonment, or death penalty.",
          "real_life_example": "If you rape someone and they die as a result, you can be sentenced to at least 20 years in prison or death penalty.",
          "punishment": "Not less than 20 years rigorous imprisonment, may extend to life imprisonment or death",
          "keywords": ["rape causing death", "persistent vegetative state", "20 years minimum", "death penalty", "Section 376A"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_376b",
          "title": "Sexual Intercourse by Husband Upon His Wife During Separation - Section 376B IPC",
          "section": "Section 376B IPC",
          "category": "Criminal Law",
          "text": "Whoever has sexual intercourse with his own wife, who is living separately from him under a decree of separation or under any custom or usage without her consent, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
          "simplified_summary": "Having sexual intercourse with your wife without her consent when you are legally separated is punishable with up to 2 years in prison and fine.",
          "real_life_example": "If you force sexual intercourse on your wife when you are legally separated and she doesn't consent, you can be jailed for up to 2 years.",
          "punishment": "Up to 2 years imprisonment and fine",
          "keywords": ["sexual intercourse separated wife", "without consent", "decree of separation", "imprisonment", "Section 376B"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_376c",
          "title": "Sexual Intercourse by a Person in Authority - Section 376C IPC",
          "section": "Section 376C IPC",
          "category": "Criminal Law",
          "text": "Whoever, being in a position of authority or in a fiduciary relationship; or a public servant; or a member of the management or staff of a jail, remand home or other place of custody; or being on the management or staff of a hospital, takes advantage of his position and commits sexual intercourse with a woman in such custody or receiving treatment, shall be punished.",
          "simplified_summary": "Using your position of authority to have sexual intercourse with a woman under your care or custody is a serious crime.",
          "real_life_example": "If you are a jail officer and force sexual intercourse on a female prisoner, you can be charged with this serious crime.",
          "punishment": "Rigorous imprisonment for not less than 5 years but which may extend to 10 years and fine",
          "keywords": ["sexual intercourse authority", "fiduciary relationship", "public servant", "imprisonment", "Section 376C"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_376d",
          "title": "Gang Rape - Section 376D IPC",
          "section": "Section 376D IPC",
          "category": "Criminal Law",
          "text": "Where a woman is raped by one or more persons constituting a group or acting in furtherance of a common intention, each of those persons shall be deemed to have committed the offence of rape and shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to life imprisonment, which shall mean imprisonment for the remainder of that person's natural life, and with fine.",
          "simplified_summary": "When a woman is raped by a group of people, each person in the group is punished with at least 20 years imprisonment, which may extend to life imprisonment, and fine.",
          "real_life_example": "If you are part of a group that rapes a woman, you will be jailed for at least 20 years and possibly for life.",
          "punishment": "Not less than 20 years rigorous imprisonment, may extend to life imprisonment and fine",
          "keywords": ["gang rape", "group rape", "common intention", "20 years minimum", "life imprisonment", "Section 376D"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_376e",
          "title": "Punishment for Repeat Offenders - Section 376E IPC",
          "section": "Section 376E IPC",
          "category": "Criminal Law",
          "text": "Whoever has been previously convicted of an offence punishable under section 376 or section 376A or section 376B or section 376C or section 376D and is subsequently convicted of an offence punishable under any of the said sections, shall be punished with imprisonment for life, which shall mean imprisonment for the remainder of that person's natural life, or with death.",
          "simplified_summary": "If you commit rape again after being previously convicted of rape, you can be sentenced to life imprisonment or death penalty.",
          "real_life_example": "If you are convicted of rape twice, you can be sentenced to life in prison or death penalty.",
          "punishment": "Life imprisonment or death",
          "keywords": ["repeat offender", "previous conviction", "life imprisonment", "death penalty", "Section 376E"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_377",
          "title": "Unnatural Offences - Section 377 IPC",
          "section": "Section 377 IPC",
          "category": "Criminal Law",
          "text": "Whoever voluntarily has carnal intercourse against the order of nature with any man, woman or animal, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
          "simplified_summary": "Having sexual intercourse against the order of nature (sodomy, bestiality) is punished with up to 10 years in prison and fine.",
          "real_life_example": "If you have sexual intercourse with an animal or engage in sodomy, you can be jailed for up to 10 years.",
          "punishment": "Up to 10 years imprisonment and fine",
          "keywords": ["unnatural offences", "carnal intercourse", "against nature", "sodomy", "Section 377"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_378",
          "title": "Theft - Section 378 IPC",
          "section": "Section 378 IPC",
          "category": "Criminal Law",
          "text": "Whoever, intending to take dishonestly any moveable property out of the possession of any person without that person's consent, moves that property in order to such taking, is said to commit theft.",
          "simplified_summary": "Taking someone's movable property without their consent with dishonest intention is called theft.",
          "real_life_example": "If you take someone's phone, wallet, or car without their permission, it is theft.",
          "punishment": "Up to 3 years imprisonment and fine",
          "keywords": ["theft", "moveable property", "without consent", "dishonest intention", "Section 378"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_379",
          "title": "Punishment for Theft - Section 379 IPC",
          "section": "Section 379 IPC",
          "category": "Criminal Law",
          "text": "Whoever commits theft shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
          "simplified_summary": "Theft is punished with up to 3 years in prison and fine.",
          "real_life_example": "If you steal something, you can be jailed for up to 3 years.",
          "punishment": "Up to 3 years imprisonment and fine",
          "keywords": ["theft punishment", "imprisonment", "fine", "3 years", "Section 379"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_380",
          "title": "Theft in Dwelling House - Section 380 IPC",
          "section": "Section 380 IPC",
          "category": "Criminal Law",
          "text": "Whoever commits theft in any building, tent or vessel, which building, tent or vessel is used as a human dwelling, or used for the custody of property, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
          "simplified_summary": "Theft from a house, tent, or vessel used as dwelling or for storing property is punished with up to 7 years in prison and fine.",
          "real_life_example": "If you steal something from someone's house, you can be jailed for up to 7 years.",
          "punishment": "Up to 7 years imprisonment and fine",
          "keywords": ["theft dwelling house", "building", "tent", "vessel", "imprisonment", "Section 380"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_381",
          "title": "Theft by Clerk or Servant of Property in Possession of Master - Section 381 IPC",
          "section": "Section 381 IPC",
          "category": "Criminal Law",
          "text": "Whoever, being a clerk or servant, or being employed in the capacity of a clerk or servant, commits theft in respect of any property in the possession of his master or employer, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
          "simplified_summary": "If you are a clerk or servant and steal from your master or employer, you can be jailed for up to 7 years.",
          "real_life_example": "If you work as a servant and steal money from your employer's house, you can be jailed for up to 7 years.",
          "punishment": "Up to 7 years imprisonment and fine",
          "keywords": ["theft by servant", "clerk", "master", "employer", "imprisonment", "Section 381"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_382",
          "title": "Theft After Preparation Made for Causing Death, Hurt or Restraint - Section 382 IPC",
          "section": "Section 382 IPC",
          "category": "Criminal Law",
          "text": "Whoever commits theft, having made preparation for causing death, or hurt, or restraint, or fear of death, or of hurt, or of restraint, to any person, in order to the committing of the theft, or in order to the effecting of the escape after the committing of the theft, or in order to the retaining of property taken by the theft, shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
          "simplified_summary": "Theft with preparation to cause death, hurt, or restraint is punished with up to 10 years rigorous imprisonment and fine.",
          "real_life_example": "If you prepare to hurt someone while stealing or to escape after stealing, you can be jailed for up to 10 years.",
          "punishment": "Up to 10 years rigorous imprisonment and fine",
          "keywords": ["theft with preparation", "death", "hurt", "restraint", "rigorous imprisonment", "Section 382"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_383",
          "title": "Extortion - Section 383 IPC",
          "section": "Section 383 IPC",
          "category": "Criminal Law",
          "text": "Whoever intentionally puts any person in fear of any injury to that person, or to any other, and thereby dishonestly induces the person so put in fear to deliver to any person any property or valuable security, or anything signed or sealed which may be converted into a valuable security, commits 'extortion'.",
          "simplified_summary": "Threatening someone with injury to force them to give you property or money is called extortion.",
          "real_life_example": "If you threaten to hurt someone unless they give you money, it is extortion.",
          "punishment": "Up to 3 years imprisonment and fine",
          "keywords": ["extortion", "fear of injury", "threat", "property", "imprisonment", "Section 383"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_384",
          "title": "Punishment for Extortion - Section 384 IPC",
          "section": "Section 384 IPC",
          "category": "Criminal Law",
          "text": "Whoever commits extortion shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
          "simplified_summary": "Extortion is punished with up to 3 years in prison and fine.",
          "real_life_example": "If you extort money from someone, you can be jailed for up to 3 years.",
          "punishment": "Up to 3 years imprisonment and fine",
          "keywords": ["extortion punishment", "imprisonment", "fine", "3 years", "Section 384"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_385",
          "title": "Putting Person in Fear of Death or of Grievous Hurt in Order to Commit Extortion - Section 385 IPC",
          "section": "Section 385 IPC",
          "category": "Criminal Law",
          "text": "Whoever, in order to the committing of extortion, puts or attempts to put any person in fear of death or of grievous hurt to that person or to any other, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
          "simplified_summary": "Threatening someone with death or serious injury to extort money is punished with up to 7 years in prison and fine.",
          "real_life_example": "If you threaten to kill someone or cause serious injury to force them to give you money, you can be jailed for up to 7 years.",
          "punishment": "Up to 7 years imprisonment and fine",
          "keywords": ["extortion with fear", "death threat", "grievous hurt", "imprisonment", "Section 385"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_386",
          "title": "Extortion by Putting a Person in Fear of Death or Grievous Hurt - Section 386 IPC",
          "section": "Section 386 IPC",
          "category": "Criminal Law",
          "text": "Whoever commits extortion by putting any person in fear of death or of grievous hurt to that person or to any other, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
          "simplified_summary": "Extorting money by threatening death or serious injury is punished with up to 10 years in prison and fine.",
          "real_life_example": "If you successfully extort money by threatening to kill someone or cause serious injury, you can be jailed for up to 10 years.",
          "punishment": "Up to 10 years imprisonment and fine",
          "keywords": ["extortion death threat", "grievous hurt", "imprisonment", "Section 386"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_387",
          "title": "Putting Person in Fear of Death or of Grievous Hurt in Order to Commit Extortion - Section 387 IPC",
          "section": "Section 387 IPC",
          "category": "Criminal Law",
          "text": "Whoever, in order to the committing of extortion, puts or attempts to put any person in fear of death or of grievous hurt to that person or to any other, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
          "simplified_summary": "Attempting to extort by threatening death or serious injury is punished with up to 7 years in prison and fine.",
          "real_life_example": "If you try to extort money by threatening to kill someone, you can be jailed for up to 7 years.",
          "punishment": "Up to 7 years imprisonment and fine",
          "keywords": ["extortion attempt", "death threat", "grievous hurt", "imprisonment", "Section 387"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_388",
          "title": "Extortion by Putting a Person in Fear of Death or Grievous Hurt - Section 388 IPC",
          "section": "Section 388 IPC",
          "category": "Criminal Law",
          "text": "Whoever commits extortion by putting any person in fear of death or of grievous hurt to that person or to any other, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
          "simplified_summary": "Successfully extorting by threatening death or serious injury is punished with up to 10 years in prison and fine.",
          "real_life_example": "If you successfully extort money by threatening serious harm, you can be jailed for up to 10 years.",
          "punishment": "Up to 10 years imprisonment and fine",
          "keywords": ["extortion success", "death threat", "grievous hurt", "imprisonment", "Section 388"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_389",
          "title": "Putting Person in Fear of Death or of Grievous Hurt in Order to Commit Extortion - Section 389 IPC",
          "section": "Section 389 IPC",
          "category": "Criminal Law",
          "text": "Whoever, in order to the committing of extortion, puts or attempts to put any person in fear of death or of grievous hurt to that person or to any other, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
          "simplified_summary": "Threatening death or serious injury to commit extortion is punished with up to 7 years in prison and fine.",
          "real_life_example": "If you threaten to kill someone to force them to give you money, you can be jailed for up to 7 years.",
          "punishment": "Up to 7 years imprisonment and fine",
          "keywords": ["extortion threat", "death", "grievous hurt", "imprisonment", "Section 389"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_390",
          "title": "Robbery - Section 390 IPC",
          "section": "Section 390 IPC",
          "category": "Criminal Law",
          "text": "In all robbery there is either theft or extortion. When theft is robbery: Theft is 'robbery' if, in order to the committing of the theft, or in committing the theft, or in carrying away or attempting to carry away property obtained by the theft, the offender, for that end, voluntarily causes or attempts to cause to any person death or hurt or wrongful restraint, or fear of instant death or of instant hurt, or of instant wrongful restraint.",
          "simplified_summary": "Robbery is theft or extortion with violence or threat of violence. Theft becomes robbery when you use force or threat of force.",
          "real_life_example": "If you steal someone's wallet while threatening them with a knife, it becomes robbery instead of just theft.",
          "punishment": "Up to 10 years rigorous imprisonment and fine",
          "keywords": ["robbery", "theft with violence", "extortion", "force", "Section 390"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_391",
          "title": "Dacoity - Section 391 IPC",
          "section": "Section 391 IPC",
          "category": "Criminal Law",
          "text": "When five or more persons conjointly commit or attempt to commit a robbery, or where the whole number of persons conjointly committing or attempting to commit a robbery, and persons present and aiding such commission or attempt, amount to five or more, every person so committing, attempting or aiding, is said to commit 'dacoity'.",
          "simplified_summary": "When 5 or more people together commit robbery, it is called dacoity.",
          "real_life_example": "If 5 or more people together rob a bank or a person, it is dacoity.",
          "punishment": "Up to 10 years rigorous imprisonment and fine",
          "keywords": ["dacoity", "5 or more persons", "conjoint robbery", "imprisonment", "Section 391"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_392",
          "title": "Punishment for Robbery - Section 392 IPC",
          "section": "Section 392 IPC",
          "category": "Criminal Law",
          "text": "Whoever commits robbery shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine; and, if the robbery be committed on the highway between sunset and sunrise, shall be punished with rigorous imprisonment for a term which may extend to fourteen years, and shall also be liable to fine.",
          "simplified_summary": "Robbery is punished with up to 10 years rigorous imprisonment and fine. If committed on highway at night, punishment is up to 14 years.",
          "real_life_example": "If you rob someone, you can be jailed for up to 10 years. If you rob on a highway at night, you can be jailed for up to 14 years.",
          "punishment": "Up to 10 years rigorous imprisonment and fine (14 years if on highway at night)",
          "keywords": ["robbery punishment", "rigorous imprisonment", "highway", "night", "Section 392"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_393",
          "title": "Attempt to Commit Robbery - Section 393 IPC",
          "section": "Section 393 IPC",
          "category": "Criminal Law",
          "text": "Whoever attempts to commit robbery shall be punished with rigorous imprisonment for a term which may extend to seven years, and shall also be liable to fine.",
          "simplified_summary": "Attempting to commit robbery is punished with up to 7 years rigorous imprisonment and fine.",
          "real_life_example": "If you try to rob someone but fail, you can still be jailed for up to 7 years.",
          "punishment": "Up to 7 years rigorous imprisonment and fine",
          "keywords": ["attempt robbery", "rigorous imprisonment", "7 years", "Section 393"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_394",
          "title": "Voluntarily Causing Hurt in Committing Robbery - Section 394 IPC",
          "section": "Section 394 IPC",
          "category": "Criminal Law",
          "text": "If any person, in committing or in attempting to commit robbery, voluntarily causes hurt, such person, and any other person jointly concerned in committing or attempting to commit such robbery, shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
          "simplified_summary": "If you cause hurt while committing robbery, you and your accomplices can be jailed for life or up to 10 years.",
          "real_life_example": "If you hurt someone while robbing them, you can be jailed for life or up to 10 years.",
          "punishment": "Life imprisonment or up to 10 years rigorous imprisonment and fine",
          "keywords": ["robbery with hurt", "voluntarily causing hurt", "life imprisonment", "Section 394"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_395",
          "title": "Punishment for Dacoity - Section 395 IPC",
          "section": "Section 395 IPC",
          "category": "Criminal Law",
          "text": "Whoever commits dacoity shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
          "simplified_summary": "Dacoity is punished with life imprisonment or up to 10 years rigorous imprisonment and fine.",
          "real_life_example": "If you are part of a group of 5 or more people that commits robbery, you can be jailed for life or up to 10 years.",
          "punishment": "Life imprisonment or up to 10 years rigorous imprisonment and fine",
          "keywords": ["dacoity punishment", "life imprisonment", "rigorous imprisonment", "Section 395"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_396",
          "title": "Dacoity with Murder - Section 396 IPC",
          "section": "Section 396 IPC",
          "category": "Criminal Law",
          "text": "If any one of five or more persons, who are conjointly committing dacoity, commits murder in so committing dacoity, every one of those persons shall be punished with death, or imprisonment for life, or rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
          "simplified_summary": "If someone in a dacoity group commits murder, all members of the group can be sentenced to death, life imprisonment, or up to 10 years.",
          "real_life_example": "If your group of 5 people commits dacoity and one of you kills someone, all of you can be sentenced to death or life in prison.",
          "punishment": "Death, life imprisonment, or up to 10 years rigorous imprisonment and fine",
          "keywords": ["dacoity with murder", "death penalty", "life imprisonment", "Section 396"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_397",
          "title": "Robbery or Dacoity with Attempt to Cause Death or Grievous Hurt - Section 397 IPC",
          "section": "Section 397 IPC",
          "category": "Criminal Law",
          "text": "If, at the time of committing robbery or dacoity, the offender uses any deadly weapon, or causes grievous hurt to any person, or attempts to cause death or grievous hurt to any person, the imprisonment with which such offender shall be punished shall not be less than seven years.",
          "simplified_summary": "If you use a deadly weapon or cause serious injury during robbery or dacoity, you must be jailed for at least 7 years.",
          "real_life_example": "If you rob someone with a knife or cause serious injury during robbery, you must be jailed for at least 7 years.",
          "punishment": "Not less than 7 years imprisonment",
          "keywords": ["robbery deadly weapon", "grievous hurt", "7 years minimum", "Section 397"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_398",
          "title": "Attempt to Commit Robbery or Dacoity When Armed with Deadly Weapon - Section 398 IPC",
          "section": "Section 398 IPC",
          "category": "Criminal Law",
          "text": "If, at the time of attempting to commit robbery or dacoity, the offender is armed with any deadly weapon, the imprisonment with which such offender shall be punished shall not be less than seven years.",
          "simplified_summary": "If you attempt robbery or dacoity while armed with a deadly weapon, you must be jailed for at least 7 years.",
          "real_life_example": "If you try to rob someone while carrying a knife or gun, you must be jailed for at least 7 years.",
          "punishment": "Not less than 7 years imprisonment",
          "keywords": ["attempt robbery armed", "deadly weapon", "7 years minimum", "Section 398"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_399",
          "title": "Making Preparation to Commit Dacoity - Section 399 IPC",
          "section": "Section 399 IPC",
          "category": "Criminal Law",
          "text": "Whoever makes any preparation for committing dacoity, shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
          "simplified_summary": "Making preparations to commit dacoity is punished with up to 10 years rigorous imprisonment and fine.",
          "real_life_example": "If you plan and prepare to commit dacoity with a group, you can be jailed for up to 10 years.",
          "punishment": "Up to 10 years rigorous imprisonment and fine",
          "keywords": ["preparation dacoity", "rigorous imprisonment", "10 years", "Section 399"],
          "source": "Indian Penal Code"
        },
        {
          "id": "ipc_400",
          "title": "Belonging to Gang of Dacoits - Section 400 IPC",
          "section": "Section 400 IPC",
          "category": "Criminal Law",
          "text": "Whoever, at any time after the passing of this Act, shall have been habitually associated with any other or others for the purpose of committing robbery or child-stealing by means of or accompanied by murder, is a thug.",
          "simplified_summary": "Being part of a gang that regularly commits robbery or child-stealing with murder is a serious crime.",
          "real_life_example": "If you regularly work with a group that robs people and sometimes kills them, you can be charged with being a thug.",
          "punishment": "Imprisonment for life and fine",
          "keywords": ["gang of dacoits", "habitual association", "robbery", "child-stealing", "murder", "Section 400"],
          "source": "Indian Penal Code"
        },
    {
      "id": "ipc_401",
      "title": "Punishment for Belonging to Gang of Dacoits - Section 401 IPC",
      "section": "Section 401 IPC",
      "category": "Criminal Law",
      "text": "Whoever, at any time after the passing of this Act, shall have been habitually associated with any other or others for the purpose of committing robbery or child-stealing by means of or accompanied by murder, shall be punished with imprisonment for life, and shall also be liable to fine.",
      "simplified_summary": "Being part of a gang that regularly commits robbery or child-stealing with murder is punished with life imprisonment and fine.",
      "real_life_example": "If you are part of a gang that regularly robs and kills people, you will spend the rest of your life in prison.",
      "punishment": "Imprisonment for life and fine",
      "keywords": ["gang punishment", "life imprisonment", "robbery gang", "child-stealing", "Section 401"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_402",
      "title": "Assembling for Purpose of Committing Dacoity - Section 402 IPC",
      "section": "Section 402 IPC",
      "category": "Criminal Law",
      "text": "Whoever, at any time after the passing of this Act, shall have been habitually associated with any other or others for the purpose of committing robbery or child-stealing by means of or accompanied by murder, shall be punished with imprisonment for life, and shall also be liable to fine.",
      "simplified_summary": "Gathering with others to plan or commit dacoity is a serious crime.",
      "real_life_example": "If you meet with a group of people to plan a robbery, you can be charged with this crime.",
      "punishment": "Up to 7 years rigorous imprisonment and fine",
      "keywords": ["assembling dacoity", "planning robbery", "rigorous imprisonment", "Section 402"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_403",
      "title": "Dishonest Misappropriation of Property - Section 403 IPC",
      "section": "Section 403 IPC",
      "category": "Criminal Law",
      "text": "Whoever dishonestly misappropriates or converts to his own use any movable property, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
      "simplified_summary": "Using someone else's movable property for your own benefit without their permission is criminal misappropriation.",
      "real_life_example": "If you find someone's lost wallet and use their money instead of returning it, it's criminal misappropriation.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["misappropriation", "movable property", "dishonest", "imprisonment", "Section 403"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_404",
      "title": "Dishonest Misappropriation of Property Possessed by Deceased Person at Time of His Death - Section 404 IPC",
      "section": "Section 404 IPC",
      "category": "Criminal Law",
      "text": "Whoever dishonestly misappropriates or converts to his own use any movable property, knowing that it was in the possession of a deceased person at the time of that person's death, and has not since been in the possession of any person legally entitled to such possession, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.",
      "simplified_summary": "Taking property from a dead person without legal right is criminal misappropriation, punished more severely.",
      "real_life_example": "If you take jewelry or money from someone who just died without being their legal heir, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["misappropriation deceased", "dead person property", "imprisonment", "Section 404"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_405",
      "title": "Criminal Breach of Trust - Section 405 IPC",
      "section": "Section 405 IPC",
      "category": "Criminal Law",
      "text": "Whoever, being in any manner entrusted with property, or with any dominion over property, dishonestly misappropriates or converts to his own use that property, or dishonestly uses or disposes of that property in violation of any direction of law prescribing the mode in which such trust is to be discharged, or of any legal contract, express or implied, which he has made touching the discharge of such trust, or wilfully suffers any other person so to do, commits 'criminal breach of trust'.",
      "simplified_summary": "If someone trusts you with their property and you use it dishonestly for your own benefit, it's criminal breach of trust.",
      "real_life_example": "If you are given money to buy something for someone but you use it for yourself instead, it's criminal breach of trust.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["criminal breach of trust", "entrusted property", "dishonest use", "imprisonment", "Section 405"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_406",
      "title": "Punishment for Criminal Breach of Trust - Section 406 IPC",
      "section": "Section 406 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits criminal breach of trust shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
      "simplified_summary": "Criminal breach of trust is punished with up to 3 years in prison and fine.",
      "real_life_example": "If you commit criminal breach of trust, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["breach of trust punishment", "imprisonment", "fine", "3 years", "Section 406"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_407",
      "title": "Criminal Breach of Trust by Carrier - Section 407 IPC",
      "section": "Section 407 IPC",
      "category": "Criminal Law",
      "text": "Whoever, being entrusted with property as a carrier, wharfinger or warehouse-keeper, commits criminal breach of trust in respect of such property, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
      "simplified_summary": "If you are a carrier, wharfinger, or warehouse-keeper and commit breach of trust with entrusted property, you can be jailed for up to 7 years.",
      "real_life_example": "If you run a transport company and steal goods entrusted to you for delivery, you can be jailed for up to 7 years.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["breach of trust carrier", "wharfinger", "warehouse-keeper", "imprisonment", "Section 407"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_408",
      "title": "Criminal Breach of Trust by Clerk or Servant - Section 408 IPC",
      "section": "Section 408 IPC",
      "category": "Criminal Law",
      "text": "Whoever, being a clerk or servant, or employed as a clerk or servant, and being in any manner entrusted in such capacity with property, or with any dominion over property, commits criminal breach of trust in respect of that property, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
      "simplified_summary": "If you are a clerk or servant and commit breach of trust with property entrusted to you, you can be jailed for up to 7 years.",
      "real_life_example": "If you work as an office clerk and steal money from your employer's safe, you can be jailed for up to 7 years.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["breach of trust clerk", "servant", "entrusted property", "imprisonment", "Section 408"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_409",
      "title": "Criminal Breach of Trust by Public Servant - Section 409 IPC",
      "section": "Section 409 IPC",
      "category": "Criminal Law",
      "text": "Whoever, being in any manner entrusted with property, or with any dominion over property in his capacity of a public servant, commits criminal breach of trust in respect of that property, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "If you are a public servant and commit breach of trust with entrusted property, you can be jailed for life or up to 10 years.",
      "real_life_example": "If you are a government officer and steal public money entrusted to you, you can be jailed for life or up to 10 years.",
      "punishment": "Life imprisonment or up to 10 years imprisonment and fine",
      "keywords": ["breach of trust public servant", "government officer", "life imprisonment", "Section 409"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_410",
      "title": "Stolen Property - Section 410 IPC",
      "section": "Section 410 IPC",
      "category": "Criminal Law",
      "text": "Property, the possession whereof has been transferred by theft, or by extortion, or by robbery, and property which has been criminally misappropriated or in respect of which criminal breach of trust has been committed, is designated as 'stolen property'.",
      "simplified_summary": "Property obtained through theft, extortion, robbery, misappropriation, or breach of trust is called stolen property.",
      "real_life_example": "If someone steals your phone and sells it to another person, that phone becomes stolen property.",
      "punishment": "Depends on the offence involving stolen property",
      "keywords": ["stolen property", "theft", "extortion", "robbery", "misappropriation", "Section 410"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_411",
      "title": "Dishonestly Receiving Stolen Property - Section 411 IPC",
      "section": "Section 411 IPC",
      "category": "Criminal Law",
      "text": "Whoever dishonestly receives or retains any stolen property, knowing or having reason to believe the same to be stolen property, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
      "simplified_summary": "Receiving or keeping stolen property knowing it's stolen is a crime punishable with up to 3 years in prison.",
      "real_life_example": "If you buy a phone knowing it was stolen, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["receiving stolen property", "dishonestly", "knowing stolen", "imprisonment", "Section 411"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_412",
      "title": "Dishonestly Receiving Property Stolen in Commission of Dacoity - Section 412 IPC",
      "section": "Section 412 IPC",
      "category": "Criminal Law",
      "text": "Whoever dishonestly receives or retains any stolen property, the possession whereof he knows or has reason to believe to have been transferred by the commission of dacoity, or dishonestly receives from a person whom he knows or has reason to believe to belong or to have belonged to a gang of dacoits, property which he knows or has reason to believe to have been stolen, shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Receiving property stolen during dacoity or from dacoits is punished with life imprisonment or up to 10 years.",
      "real_life_example": "If you receive property knowing it was stolen during a dacoity, you can be jailed for life or up to 10 years.",
      "punishment": "Life imprisonment or up to 10 years rigorous imprisonment and fine",
      "keywords": ["receiving dacoity property", "gang of dacoits", "life imprisonment", "Section 412"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_413",
      "title": "Habitually Dealing in Stolen Property - Section 413 IPC",
      "section": "Section 413 IPC",
      "category": "Criminal Law",
      "text": "Whoever habitually receives or deals in property which he knows or has reason to believe to be stolen property, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Regularly dealing in stolen property is punished with life imprisonment or up to 10 years.",
      "real_life_example": "If you regularly buy and sell stolen goods, you can be jailed for life or up to 10 years.",
      "punishment": "Life imprisonment or up to 10 years imprisonment and fine",
      "keywords": ["habitually dealing stolen", "regular dealing", "life imprisonment", "Section 413"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_414",
      "title": "Assisting in Concealment of Stolen Property - Section 414 IPC",
      "section": "Section 414 IPC",
      "category": "Criminal Law",
      "text": "Whoever voluntarily assists in concealing or disposing of or making away with property which he knows or has reason to believe to be stolen property, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
      "simplified_summary": "Helping to hide or dispose of stolen property is punished with up to 3 years in prison and fine.",
      "real_life_example": "If you help someone hide stolen goods, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["assisting concealment", "hiding stolen property", "disposing stolen", "imprisonment", "Section 414"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_415",
      "title": "Cheating - Section 415 IPC",
      "section": "Section 415 IPC",
      "category": "Criminal Law",
      "text": "Whoever, by deceiving any person, fraudulently or dishonestly induces the person so deceived to deliver any property to any person, or to consent that any person shall retain any property, or intentionally induces the person so deceived to do or omit to do anything which he would not do or omit if he were not so deceived, and which act or omission causes or is likely to cause damage or harm to that person in body, mind, reputation or property, is said to 'cheat'.",
      "simplified_summary": "Cheating means deceiving someone to get property from them or make them do something that harms them.",
      "real_life_example": "If you lie to someone to get their money or make them sign a harmful contract, it's cheating.",
      "punishment": "Up to 1 year imprisonment and fine",
      "keywords": ["cheating", "deceiving", "fraudulently", "dishonestly", "Section 415"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_416",
      "title": "Cheating by Personation - Section 416 IPC",
      "section": "Section 416 IPC",
      "category": "Criminal Law",
      "text": "A person is said to 'cheat by personation' if he cheats by pretending to be some other person, or by knowingly substituting one person for another, or representing that he or any other person is a person other than he or such other person really is.",
      "simplified_summary": "Cheating by pretending to be someone else or substituting one person for another is called cheating by personation.",
      "real_life_example": "If you pretend to be someone else to get their benefits or make them sign documents, it's cheating by personation.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["cheating by personation", "pretending", "substituting person", "imprisonment", "Section 416"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_417",
      "title": "Punishment for Cheating - Section 417 IPC",
      "section": "Section 417 IPC",
      "category": "Criminal Law",
      "text": "Whoever cheats shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.",
      "simplified_summary": "Cheating is punished with up to 1 year in prison and fine.",
      "real_life_example": "If you cheat someone, you can be jailed for up to 1 year.",
      "punishment": "Up to 1 year imprisonment and fine",
      "keywords": ["cheating punishment", "imprisonment", "fine", "1 year", "Section 417"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_418",
      "title": "Cheating with Knowledge that Wrongful Loss May Ensue to Person Whose Interest Offender is Bound to Protect - Section 418 IPC",
      "section": "Section 418 IPC",
      "category": "Criminal Law",
      "text": "Whoever cheats with the knowledge that he is likely thereby to cause wrongful loss to a person whose interest in the transaction to which the cheating relates, he was bound, either by law, or by a legal contract, to protect, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
      "simplified_summary": "Cheating someone whose interests you are legally bound to protect is punished with up to 3 years in prison and fine.",
      "real_life_example": "If you are a lawyer and cheat your client, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["cheating bound to protect", "legal contract", "wrongful loss", "imprisonment", "Section 418"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_419",
      "title": "Punishment for Cheating by Personation - Section 419 IPC",
      "section": "Section 419 IPC",
      "category": "Criminal Law",
      "text": "Whoever cheats by personation shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
      "simplified_summary": "Cheating by personation is punished with up to 3 years in prison and fine.",
      "real_life_example": "If you cheat by pretending to be someone else, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["cheating personation punishment", "imprisonment", "fine", "3 years", "Section 419"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_420",
      "title": "Cheating and Dishonestly Inducing Delivery of Property - Section 420 IPC",
      "section": "Section 420 IPC",
      "category": "Criminal Law",
      "text": "Whoever cheats and thereby dishonestly induces the person deceived to deliver any property to any person, or to make, alter or destroy the whole or any part of a valuable security, or anything which is signed or sealed, and which is capable of being converted into a valuable security, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
      "simplified_summary": "Cheating to get property or valuable documents is punished with up to 7 years in prison and fine.",
      "real_life_example": "If you cheat someone to get their money or property, you can be jailed for up to 7 years.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["cheating property", "dishonestly inducing", "valuable security", "imprisonment", "Section 420"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_421",
      "title": "Dishonest or Fraudulent Removal or Concealment of Property - Section 421 IPC",
      "section": "Section 421 IPC",
      "category": "Criminal Law",
      "text": "Whoever dishonestly or fraudulently removes, conceals, or delivers to any person, or transfers or causes to be transferred to any person, without adequate consideration, any property, intending thereby to prevent, or knowing it to be likely that he will thereby prevent, the distribution of that property according to law among his creditors or creditors of any other person, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
      "simplified_summary": "Hiding or transferring property to avoid paying creditors is punished with up to 2 years in prison and fine.",
      "real_life_example": "If you hide your property to avoid paying your debts, you can be jailed for up to 2 years.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["dishonest removal", "concealment property", "creditors", "imprisonment", "Section 421"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_422",
      "title": "Dishonestly or Fraudulently Preventing Debt Being Available for Creditors - Section 422 IPC",
      "section": "Section 422 IPC",
      "category": "Criminal Law",
      "text": "Whoever dishonestly or fraudulently prevents any debt or demand due to himself or to any other person from being made available according to law for payment of his debts or the debts of such other person, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
      "simplified_summary": "Preventing debts from being available to pay creditors is punished with up to 2 years in prison and fine.",
      "real_life_example": "If you prevent money owed to you from being used to pay your debts, you can be jailed for up to 2 years.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["preventing debt", "creditors", "fraudulently", "imprisonment", "Section 422"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_423",
      "title": "Dishonest or Fraudulent Execution of Deed of Transfer Containing False Statement of Consideration - Section 423 IPC",
      "section": "Section 423 IPC",
      "category": "Criminal Law",
      "text": "Whoever dishonestly or fraudulently signs, executes or becomes a party to any deed or instrument which purports to transfer or subject to any charge any property, or any interest therein, and which contains any false statement relating to the consideration for such transfer or charge, or to the person or persons for whose use or benefit it is really intended to operate, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
      "simplified_summary": "Making false statements in property transfer documents is punished with up to 2 years in prison and fine.",
      "real_life_example": "If you lie about the price or purpose in a property sale document, you can be jailed for up to 2 years.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["false statement deed", "property transfer", "consideration", "imprisonment", "Section 423"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_424",
      "title": "Dishonest or Fraudulent Removal or Concealment of Property - Section 424 IPC",
      "section": "Section 424 IPC",
      "category": "Criminal Law",
      "text": "Whoever dishonestly or fraudulently conceals or removes any property of himself or any other person, or dishonestly or fraudulently assists in the concealment or removal thereof, or dishonestly releases any demand or claim to which he is entitled, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
      "simplified_summary": "Hiding or removing property to avoid legal obligations is punished with up to 2 years in prison and fine.",
      "real_life_example": "If you hide your car to avoid it being seized for debts, you can be jailed for up to 2 years.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["concealment property", "removal property", "dishonest", "imprisonment", "Section 424"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_425",
      "title": "Mischief - Section 425 IPC",
      "section": "Section 425 IPC",
      "category": "Criminal Law",
      "text": "Whoever with intent to cause, or knowing that he is likely to cause, wrongful loss or damage to the public or to any person, causes the destruction of any property, or any such change in any property or in the situation thereof as destroys or diminishes its value or utility, or affects it injuriously, commits 'mischief'.",
      "simplified_summary": "Intentionally damaging or destroying someone's property is called mischief.",
      "real_life_example": "If you break someone's window or damage their car intentionally, it's mischief.",
      "punishment": "Up to 3 months imprisonment and fine up to 500 rupees",
      "keywords": ["mischief", "destruction property", "wrongful loss", "damage", "Section 425"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_426",
      "title": "Punishment for Mischief - Section 426 IPC",
      "section": "Section 426 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief shall be punished with imprisonment of either description for a term which may extend to three months, or with fine, or with both.",
      "simplified_summary": "Mischief is punished with up to 3 months in prison and fine.",
      "real_life_example": "If you damage someone's property, you can be jailed for up to 3 months.",
      "punishment": "Up to 3 months imprisonment and fine",
      "keywords": ["mischief punishment", "imprisonment", "fine", "3 months", "Section 426"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_427",
      "title": "Mischief Causing Damage to the Amount of Fifty Rupees - Section 427 IPC",
      "section": "Section 427 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief and thereby causes loss or damage to the amount of fifty rupees or upwards, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
      "simplified_summary": "Mischief causing damage worth 50 rupees or more is punished with up to 2 years in prison and fine.",
      "real_life_example": "If you damage someone's property worth 100 rupees, you can be jailed for up to 2 years.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["mischief 50 rupees", "damage amount", "imprisonment", "Section 427"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_428",
      "title": "Mischief by Killing or Maiming Animal - Section 428 IPC",
      "section": "Section 428 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief by killing, poisoning, maiming or rendering useless any animal of the value of ten rupees or upwards, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
      "simplified_summary": "Killing, poisoning, or injuring an animal worth 10 rupees or more is punished with up to 2 years in prison and fine.",
      "real_life_example": "If you poison someone's pet dog or cow, you can be jailed for up to 2 years.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["mischief animal", "killing animal", "poisoning", "maiming", "Section 428"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_429",
      "title": "Mischief by Killing or Maiming Cattle - Section 429 IPC",
      "section": "Section 429 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief by killing, poisoning, maiming or rendering useless any elephant, camel, horse, mule, buffalo, bull, cow or ox, whatever may be the value thereof, or any other animal of the value of fifty rupees or upwards, shall be punished with imprisonment of either description for a term which may extend to five years, or with fine, or with both.",
      "simplified_summary": "Killing or injuring cattle or valuable animals is punished with up to 5 years in prison and fine.",
      "real_life_example": "If you kill someone's cow or horse, you can be jailed for up to 5 years.",
      "punishment": "Up to 5 years imprisonment and fine",
      "keywords": ["mischief cattle", "killing cattle", "elephant", "cow", "horse", "Section 429"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_430",
      "title": "Mischief by Injury to Works of Irrigation - Section 430 IPC",
      "section": "Section 430 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief by doing any act which causes, or which he knows to be likely to cause, a diminution of the supply of water for agricultural purposes, or for food or drink for human beings or for animals which are property, or for cleanliness or for carrying on any manufacture, shall be punished with imprisonment of either description for a term which may extend to five years, or with fine, or with both.",
      "simplified_summary": "Damaging irrigation works or water supply is punished with up to 5 years in prison and fine.",
      "real_life_example": "If you damage a canal or water tank that supplies water for farming, you can be jailed for up to 5 years.",
      "punishment": "Up to 5 years imprisonment and fine",
      "keywords": ["mischief irrigation", "water supply", "agricultural purposes", "imprisonment", "Section 430"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_431",
      "title": "Mischief by Injury to Public Road, Bridge, River or Channel - Section 431 IPC",
      "section": "Section 431 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief by doing any act which renders or which he knows to be likely to render any public road, bridge, navigable river or navigable channel, natural or artificial, impassable or less safe for travelling or conveying property, shall be punished with imprisonment of either description for a term which may extend to five years, or with fine, or with both.",
      "simplified_summary": "Damaging public roads, bridges, or waterways is punished with up to 5 years in prison and fine.",
      "real_life_example": "If you damage a public bridge or road making it unsafe, you can be jailed for up to 5 years.",
      "punishment": "Up to 5 years imprisonment and fine",
      "keywords": ["mischief public road", "bridge", "river", "channel", "imprisonment", "Section 431"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_432",
      "title": "Mischief by Causing Inundation or Obstruction to Public Drain - Section 432 IPC",
      "section": "Section 432 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief by doing any act which causes, or which he knows to be likely to cause, an inundation or an obstruction to any public drainage carried on by the public or by any municipal body, shall be punished with imprisonment of either description for a term which may extend to five years, or with fine, or with both.",
      "simplified_summary": "Causing flooding or blocking public drainage is punished with up to 5 years in prison and fine.",
      "real_life_example": "If you block a public drain causing flooding, you can be jailed for up to 5 years.",
      "punishment": "Up to 5 years imprisonment and fine",
      "keywords": ["mischief inundation", "public drainage", "flooding", "obstruction", "Section 432"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_433",
      "title": "Mischief by Destroying, Moving or Rendering Less Useful a Lighthouse or Sea-Mark - Section 433 IPC",
      "section": "Section 433 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief by destroying or moving any lighthouse or other light used as a sea-mark, or any sea-mark or buoy or other thing placed as a guide for navigators, or by any act which renders any such lighthouse, sea-mark, buoy or other thing less useful as a guide for navigators, shall be punished with imprisonment of either description for a term which may extend to five years, or with fine, or with both.",
      "simplified_summary": "Damaging lighthouses or sea-marks is punished with up to 5 years in prison and fine.",
      "real_life_example": "If you damage a lighthouse or sea buoy, you can be jailed for up to 5 years.",
      "punishment": "Up to 5 years imprisonment and fine",
      "keywords": ["mischief lighthouse", "sea-mark", "navigators", "buoy", "imprisonment", "Section 433"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_434",
      "title": "Mischief by Destroying or Moving, etc., a Land-Mark Fixed by Public Authority - Section 434 IPC",
      "section": "Section 434 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief by destroying or moving any land-mark fixed by the authority of a public servant, or by any act which renders such land-mark less useful as such, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.",
      "simplified_summary": "Damaging or moving land-marks fixed by public authority is punished with up to 1 year in prison and fine.",
      "real_life_example": "If you remove or damage a boundary stone placed by government, you can be jailed for up to 1 year.",
      "punishment": "Up to 1 year imprisonment and fine",
      "keywords": ["mischief land-mark", "public authority", "boundary stone", "imprisonment", "Section 434"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_435",
      "title": "Mischief by Fire or Explosive Substance - Section 435 IPC",
      "section": "Section 435 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief by fire or any explosive substance, intending to cause, or knowing it to be likely that he will thereby cause, damage to any property to the amount of one hundred rupees or upwards, or any property which is used for the purpose of Government or any local authority, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
      "simplified_summary": "Using fire or explosives to damage property worth 100 rupees or more, or government property, is punished with up to 7 years in prison and fine.",
      "real_life_example": "If you set fire to someone's house or government building, you can be jailed for up to 7 years.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["mischief fire", "explosive substance", "government property", "imprisonment", "Section 435"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_436",
      "title": "Mischief by Fire or Explosive Substance with Intent to Destroy House - Section 436 IPC",
      "section": "Section 436 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief by fire or any explosive substance, intending to cause, or knowing it to be likely that he will thereby cause, the destruction of any building which is ordinarily used as a place of worship or as a human dwelling or as a place for the custody of property, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Using fire or explosives to destroy places of worship, houses, or property storage is punished with life imprisonment or up to 10 years.",
      "real_life_example": "If you burn down a temple, mosque, or someone's house, you can be jailed for life or up to 10 years.",
      "punishment": "Life imprisonment or up to 10 years imprisonment and fine",
      "keywords": ["mischief fire building", "place of worship", "human dwelling", "life imprisonment", "Section 436"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_437",
      "title": "Mischief with Intent to Destroy or Make Unsafe a Decked Vessel - Section 437 IPC",
      "section": "Section 437 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief to any decked vessel or any vessel of a burden of twenty tons or upwards, intending to destroy or render unsafe such vessel, or knowing it to be likely that he will thereby destroy or render unsafe such vessel, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Damaging a ship or large vessel to destroy or make it unsafe is punished with up to 10 years in prison and fine.",
      "real_life_example": "If you damage a ship to make it sink or unsafe, you can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["mischief vessel", "decked vessel", "destroy ship", "imprisonment", "Section 437"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_438",
      "title": "Punishment for the Mischief Described in Section 437 - Section 438 IPC",
      "section": "Section 438 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits, or attempts to commit, by fire or any explosive substance, such mischief as is described in the last preceding section, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Using fire or explosives to damage a ship is punished with life imprisonment or up to 10 years.",
      "real_life_example": "If you use explosives to damage a ship, you can be jailed for life or up to 10 years.",
      "punishment": "Life imprisonment or up to 10 years imprisonment and fine",
      "keywords": ["mischief fire vessel", "explosive ship", "life imprisonment", "Section 438"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_439",
      "title": "Punishment for Intentionally Running Vessel Aground or Ashore - Section 439 IPC",
      "section": "Section 439 IPC",
      "category": "Criminal Law",
      "text": "Whoever intentionally runs any vessel aground or ashore, intending to commit theft of any property contained therein or to dishonestly misappropriate any such property, or with intent to cause wrongful loss to any person, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "Intentionally running a ship aground to steal from it is punished with up to 10 years in prison and fine.",
      "real_life_example": "If you intentionally run a ship aground to steal cargo, you can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["running vessel aground", "theft from ship", "intentionally", "imprisonment", "Section 439"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_440",
      "title": "Mischief Committed After Preparation Made for Causing Death or Hurt - Section 440 IPC",
      "section": "Section 440 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits mischief, having made preparation for causing death or hurt to any person, or for causing wrongful restraint, or fear of death or of hurt to any person, or of wrongful restraint, shall be punished with imprisonment of either description for a term which may extend to five years, or with fine, or with both.",
      "simplified_summary": "Committing mischief with preparation to cause death, hurt, or fear is punished with up to 5 years in prison and fine.",
      "real_life_example": "If you prepare to hurt someone while damaging their property, you can be jailed for up to 5 years.",
      "punishment": "Up to 5 years imprisonment and fine",
      "keywords": ["mischief with preparation", "death", "hurt", "fear", "imprisonment", "Section 440"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_441",
      "title": "Criminal Trespass - Section 441 IPC",
      "section": "Section 441 IPC",
      "category": "Criminal Law",
      "text": "Whoever enters into or upon property in the possession of another with intent to commit an offence or to intimidate, insult or annoy any person in possession of such property, or having lawfully entered into or upon such property, unlawfully remains there with intent thereby to intimidate, insult or annoy any such person, or with intent to commit an offence, is said to commit 'criminal trespass'.",
      "simplified_summary": "Entering someone's property without permission to commit a crime or annoy them is called criminal trespass.",
      "real_life_example": "If you enter someone's house without permission to steal or annoy them, it's criminal trespass.",
      "punishment": "Up to 3 months imprisonment and fine up to 500 rupees",
      "keywords": ["criminal trespass", "entering property", "without permission", "annoy", "Section 441"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_442",
      "title": "House-Trespass - Section 442 IPC",
      "section": "Section 442 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits criminal trespass by entering into or remaining in any building, tent or vessel used as a human dwelling, or any building used as a place for worship, or as a place for the custody of property, is said to commit 'house-trespass'.",
      "simplified_summary": "Criminal trespass into a house, tent, vessel, place of worship, or property storage is called house-trespass.",
      "real_life_example": "If you enter someone's house without permission, it's house-trespass.",
      "punishment": "Up to 1 year imprisonment and fine up to 1000 rupees",
      "keywords": ["house-trespass", "building", "tent", "vessel", "dwelling", "Section 442"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_443",
      "title": "Lurking House-Trespass - Section 443 IPC",
      "section": "Section 443 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits house-trespass having taken precautions to conceal such house-trespass from some person who has a right to exclude or eject the trespasser from the building, tent or vessel which is the subject of the trespass, is said to commit 'lurking house-trespass'.",
      "simplified_summary": "House-trespass while hiding to avoid being seen is called lurking house-trespass.",
      "real_life_example": "If you sneak into someone's house at night to avoid being seen, it's lurking house-trespass.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["lurking house-trespass", "conceal", "hide", "imprisonment", "Section 443"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_444",
      "title": "Lurking House-Trespass by Night - Section 444 IPC",
      "section": "Section 444 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits lurking house-trespass after sunset and before sunrise, is said to commit 'lurking house-trespass by night'.",
      "simplified_summary": "Lurking house-trespass at night (between sunset and sunrise) is a more serious crime.",
      "real_life_example": "If you sneak into someone's house at night, it's lurking house-trespass by night.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["lurking house-trespass night", "sunset", "sunrise", "imprisonment", "Section 444"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_445",
      "title": "House-Breaking - Section 445 IPC",
      "section": "Section 445 IPC",
      "category": "Criminal Law",
      "text": "A person is said to commit 'house-breaking' who commits house-trespass if he effects his entrance into the house or any part of it in any of the six ways hereinafter described; or if, being in the house or any part of it for the purpose of committing an offence, or having committed an offence therein, he quits the house or any part of it in any of such six ways.",
      "simplified_summary": "House-trespass by entering or leaving through doors, windows, or other openings is called house-breaking.",
      "real_life_example": "If you break into someone's house through a window or door, it's house-breaking.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["house-breaking", "entrance", "exit", "doors", "windows", "Section 445"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_446",
      "title": "House-Breaking by Night - Section 446 IPC",
      "section": "Section 446 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits house-breaking after sunset and before sunrise, is said to commit 'house-breaking by night'.",
      "simplified_summary": "House-breaking at night (between sunset and sunrise) is a more serious crime.",
      "real_life_example": "If you break into someone's house at night, it's house-breaking by night.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["house-breaking night", "sunset", "sunrise", "imprisonment", "Section 446"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_447",
      "title": "Punishment for Criminal Trespass - Section 447 IPC",
      "section": "Section 447 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits criminal trespass shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to five hundred rupees, or with both.",
      "simplified_summary": "Criminal trespass is punished with up to 3 months in prison or 500 rupees fine.",
      "real_life_example": "If you enter someone's property without permission, you can be jailed for up to 3 months or fined 500 rupees.",
      "punishment": "Up to 3 months imprisonment and fine up to 500 rupees",
      "keywords": ["criminal trespass punishment", "imprisonment", "fine", "500 rupees", "Section 447"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_448",
      "title": "Punishment for House-Trespass - Section 448 IPC",
      "section": "Section 448 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits house-trespass shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to one thousand rupees, or with both.",
      "simplified_summary": "House-trespass is punished with up to 1 year in prison or 1000 rupees fine.",
      "real_life_example": "If you enter someone's house without permission, you can be jailed for up to 1 year or fined 1000 rupees.",
      "punishment": "Up to 1 year imprisonment and fine up to 1000 rupees",
      "keywords": ["house-trespass punishment", "imprisonment", "fine", "1000 rupees", "Section 448"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_449",
      "title": "Punishment for Lurking House-Trespass - Section 449 IPC",
      "section": "Section 449 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits lurking house-trespass shall be punished with imprisonment of either description for a term which may extend to two years, and shall also be liable to fine.",
      "simplified_summary": "Lurking house-trespass is punished with up to 2 years in prison and fine.",
      "real_life_example": "If you sneak into someone's house to avoid being seen, you can be jailed for up to 2 years.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["lurking house-trespass punishment", "imprisonment", "fine", "2 years", "Section 449"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_450",
      "title": "Punishment for Lurking House-Trespass by Night - Section 450 IPC",
      "section": "Section 450 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits lurking house-trespass by night shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.",
      "simplified_summary": "Lurking house-trespass at night is punished with up to 3 years in prison and fine.",
      "real_life_example": "If you sneak into someone's house at night, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["lurking house-trespass night punishment", "imprisonment", "fine", "3 years", "Section 450"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_451",
      "title": "Punishment for House-Breaking - Section 451 IPC",
      "section": "Section 451 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits house-breaking shall be punished with imprisonment of either description for a term which may extend to two years, and shall also be liable to fine.",
      "simplified_summary": "House-breaking is punished with up to 2 years in prison and fine.",
      "real_life_example": "If you break into someone's house, you can be jailed for up to 2 years.",
      "punishment": "Up to 2 years imprisonment and fine",
      "keywords": ["house-breaking punishment", "imprisonment", "fine", "2 years", "Section 451"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_452",
      "title": "Punishment for House-Breaking by Night - Section 452 IPC",
      "section": "Section 452 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits house-breaking by night shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.",
      "simplified_summary": "House-breaking at night is punished with up to 3 years in prison and fine.",
      "real_life_example": "If you break into someone's house at night, you can be jailed for up to 3 years.",
      "punishment": "Up to 3 years imprisonment and fine",
      "keywords": ["house-breaking night punishment", "imprisonment", "fine", "3 years", "Section 452"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_453",
      "title": "Punishment for Lurking House-Trespass or House-Breaking After Preparation for Hurt, Assault or Wrongful Restraint - Section 453 IPC",
      "section": "Section 453 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits lurking house-trespass or house-breaking, having made preparation for causing hurt to any person or for assaulting any person, or for wrongfully restraining any person, or for putting any person in fear of death or of hurt, or of wrongful restraint, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
      "simplified_summary": "House-trespass or house-breaking with preparation to hurt, assault, or restrain someone is punished with up to 7 years in prison and fine.",
      "real_life_example": "If you break into someone's house with a weapon to hurt them, you can be jailed for up to 7 years.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["house-trespass with preparation", "hurt", "assault", "wrongful restraint", "imprisonment", "Section 453"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_454",
      "title": "Punishment for Lurking House-Trespass or House-Breaking by Night After Preparation for Hurt, Assault or Wrongful Restraint - Section 454 IPC",
      "section": "Section 454 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits lurking house-trespass by night or house-breaking by night, having made preparation for causing hurt to any person or for assaulting any person, or for wrongfully restraining any person, or for putting any person in fear of death or of hurt, or of wrongful restraint, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "House-trespass or house-breaking at night with preparation to hurt someone is punished with up to 10 years in prison and fine.",
      "real_life_example": "If you break into someone's house at night with a weapon to hurt them, you can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["house-trespass night preparation", "hurt", "assault", "imprisonment", "Section 454"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_455",
      "title": "Punishment for Lurking House-Trespass or House-Breaking After Preparation for Hurt, Assault or Wrongful Restraint - Section 455 IPC",
      "section": "Section 455 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits lurking house-trespass or house-breaking, having made preparation for causing hurt to any person or for assaulting any person, or for wrongfully restraining any person, or for putting any person in fear of death or of hurt, or of wrongful restraint, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
      "simplified_summary": "House-trespass or house-breaking with preparation to hurt someone is punished with up to 7 years in prison and fine.",
      "real_life_example": "If you break into someone's house with preparation to hurt them, you can be jailed for up to 7 years.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["house-trespass preparation", "hurt", "assault", "imprisonment", "Section 455"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_456",
      "title": "Punishment for Lurking House-Trespass or House-Breaking by Night After Preparation for Hurt, Assault or Wrongful Restraint - Section 456 IPC",
      "section": "Section 456 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits lurking house-trespass by night or house-breaking by night, having made preparation for causing hurt to any person or for assaulting any person, or for wrongfully restraining any person, or for putting any person in fear of death or of hurt, or of wrongful restraint, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "House-trespass or house-breaking at night with preparation to hurt someone is punished with up to 10 years in prison and fine.",
      "real_life_example": "If you break into someone's house at night with preparation to hurt them, you can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["house-trespass night preparation", "hurt", "assault", "imprisonment", "Section 456"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_457",
      "title": "Punishment for Lurking House-Trespass or House-Breaking After Preparation for Hurt, Assault or Wrongful Restraint - Section 457 IPC",
      "section": "Section 457 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits lurking house-trespass or house-breaking, having made preparation for causing hurt to any person or for assaulting any person, or for wrongfully restraining any person, or for putting any person in fear of death or of hurt, or of wrongful restraint, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
      "simplified_summary": "House-trespass or house-breaking with preparation to hurt someone is punished with up to 7 years in prison and fine.",
      "real_life_example": "If you break into someone's house with preparation to hurt them, you can be jailed for up to 7 years.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["house-trespass preparation", "hurt", "assault", "imprisonment", "Section 457"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_458",
      "title": "Punishment for Lurking House-Trespass or House-Breaking by Night After Preparation for Hurt, Assault or Wrongful Restraint - Section 458 IPC",
      "section": "Section 458 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits lurking house-trespass by night or house-breaking by night, having made preparation for causing hurt to any person or for assaulting any person, or for wrongfully restraining any person, or for putting any person in fear of death or of hurt, or of wrongful restraint, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "House-trespass or house-breaking at night with preparation to hurt someone is punished with up to 10 years in prison and fine.",
      "real_life_example": "If you break into someone's house at night with preparation to hurt them, you can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["house-trespass night preparation", "hurt", "assault", "imprisonment", "Section 458"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_459",
      "title": "Punishment for Lurking House-Trespass or House-Breaking After Preparation for Hurt, Assault or Wrongful Restraint - Section 459 IPC",
      "section": "Section 459 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits lurking house-trespass or house-breaking, having made preparation for causing hurt to any person or for assaulting any person, or for wrongfully restraining any person, or for putting any person in fear of death or of hurt, or of wrongful restraint, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
      "simplified_summary": "House-trespass or house-breaking with preparation to hurt someone is punished with up to 7 years in prison and fine.",
      "real_life_example": "If you break into someone's house with preparation to hurt them, you can be jailed for up to 7 years.",
      "punishment": "Up to 7 years imprisonment and fine",
      "keywords": ["house-trespass preparation", "hurt", "assault", "imprisonment", "Section 459"],
      "source": "Indian Penal Code"
    },
    {
      "id": "ipc_460",
      "title": "Punishment for Lurking House-Trespass or House-Breaking by Night After Preparation for Hurt, Assault or Wrongful Restraint - Section 460 IPC",
      "section": "Section 460 IPC",
      "category": "Criminal Law",
      "text": "Whoever commits lurking house-trespass by night or house-breaking by night, having made preparation for causing hurt to any person or for assaulting any person, or for wrongfully restraining any person, or for putting any person in fear of death or of hurt, or of wrongful restraint, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
      "simplified_summary": "House-trespass or house-breaking at night with preparation to hurt someone is punished with up to 10 years in prison and fine.",
      "real_life_example": "If you break into someone's house at night with preparation to hurt them, you can be jailed for up to 10 years.",
      "punishment": "Up to 10 years imprisonment and fine",
      "keywords": ["house-trespass night preparation", "hurt", "assault", "imprisonment", "Section 460"],
      "source": "Indian Penal Code"
    }
]
