[
  {
    "title": "Fundamental Rights - Complete Guide",
    "content": "The Fundamental Rights in India are enshrined in Part III (Articles 12-35) of the Constitution. These rights are essential for the development of human personality and are guaranteed by the Constitution. The six categories of fundamental rights are: 1) Right to Equality (Articles 14-18), 2) Right to Freedom (Articles 19-22), 3) Right against Exploitation (Articles 23-24), 4) Right to Freedom of Religion (Articles 25-28), 5) Cultural and Educational Rights (Articles 29-30), and 6) Right to Constitutional Remedies (Article 32). These rights can be enforced through writ petitions in the Supreme Court under Article 32 or in High Courts under Article 226. The Supreme Court has expanded the scope of these rights through various landmark judgments.",
    "category": "constitutional_law",
    "citations": [
      "Article 12-35",
      "Kesavananda Bharati v. State of Kerala",
      "Maneka Gandhi v. Union of India"
    ]
  },
  {
    "title": "Article 14 - Equality Before Law",
    "content": "Article 14 states: 'The State shall not deny to any person equality before the law or the equal protection of the laws within the territory of India.' This article ensures that all persons are equal before the law and are entitled to equal protection of laws. It prohibits discrimination on grounds of religion, race, caste, sex, or place of birth. The principle of equality is a fundamental feature of the Indian Constitution and forms the basis of democracy. The Supreme Court has interpreted this article to include the concept of 'reasonable classification' where equals are treated equally and unequals are treated differently based on intelligible differentia.",
    "category": "fundamental_rights",
    "citations": [
      "Article 14",
      "State of West Bengal v. Anwar Ali Sarkar",
      "E.P. Royappa v. State of Tamil Nadu"
    ]
  },
  {
    "title": "Article 19 - Freedom of Speech and Expression",
    "content": "Article 19(1)(a) guarantees the right to freedom of speech and expression to all citizens. This includes the right to express one's views, opinions, and ideas through any medium including print, electronic, and digital media. However, this right is subject to reasonable restrictions under Article 19(2) in the interests of sovereignty and integrity of India, security of the State, friendly relations with foreign States, public order, decency or morality, contempt of court, defamation, or incitement to an offence. The Supreme Court has held that this right includes the right to information, right to criticize government policies, and right to commercial speech.",
    "category": "fundamental_rights",
    "citations": [
      "Article 19(1)(a)",
      "Romesh Thapar v. State of Madras",
      "Sakal Papers v. Union of India"
    ]
  },
  {
    "title": "Article 21 - Right to Life and Personal Liberty",
    "content": "Article 21 states: 'No person shall be deprived of his life or personal liberty except according to procedure established by law.' This article has been interpreted broadly by the Supreme Court to include the right to live with human dignity, right to livelihood, right to health, right to education, right to privacy, right to clean environment, and right to die with dignity. It forms the foundation of human rights in India and has been used to expand the scope of fundamental rights through judicial activism. The procedure established by law must be fair, just, and reasonable.",
    "category": "fundamental_rights",
    "citations": [
      "Article 21",
      "Maneka Gandhi v. Union of India",
      "Francis Coralie Mullin v. Administrator"
    ]
  },
  {
    "title": "Article 32 - Right to Constitutional Remedies",
    "content": "Article 32 provides the right to move the Supreme Court for the enforcement of fundamental rights. It is called the 'heart and soul' of the Constitution by Dr. B.R. Ambedkar. The Supreme Court can issue writs like Habeas Corpus (to produce a person), Mandamus (to command public authority), Prohibition (to prevent lower court from exceeding jurisdiction), Certiorari (to quash lower court decision), and Quo Warranto (to question authority of public office holder). This article makes fundamental rights justiciable and enforceable. It is a fundamental right itself and cannot be suspended except during emergency.",
    "category": "constitutional_remedies",
    "citations": [
      "Article 32",
      "Kesavananda Bharati v. State of Kerala",
      "Minerva Mills v. Union of India"
    ]
  },
  {
    "title": "Writ Petitions - Complete Guide",
    "content": "Writ petitions are formal written applications to a court requesting judicial action. In India, five types of writs are available under Articles 32 and 226: 1) Habeas Corpus - to produce a person before the court and ensure their liberty, 2) Mandamus - to command a public authority to perform its legal duty, 3) Prohibition - to prevent a lower court from exceeding its jurisdiction, 4) Certiorari - to quash the decision of a lower court or tribunal, and 5) Quo Warranto - to question the authority of a person holding a public office. These writs are essential for protecting fundamental rights and ensuring good governance.",
    "category": "legal_procedures",
    "citations": [
      "Article 226",
      "R. v. Secretary of State",
      "State of Orissa v. Madan Gopal"
    ]
  },
  {
    "title": "Criminal Law - IPC Overview",
    "content": "The Indian Penal Code (IPC) is the main criminal law of India. It defines various offences and their punishments. Key sections include: Section 299-304 (Culpable Homicide and Murder), Section 307-308 (Attempt to Murder), Section 375-376 (Rape), Section 420 (Cheating), Section 406 (Criminal Breach of Trust), Section 498A (Cruelty by Husband), Section 304B (Dowry Death), and Section 302 (Murder). The IPC is supplemented by various special laws like the Prevention of Corruption Act, Narcotic Drugs and Psychotropic Substances Act, and Information Technology Act.",
    "category": "criminal_law",
    "citations": [
      "IPC 1860",
      "State of Maharashtra v. Prafull B. Desai",
      "State of Punjab v. Gurmit Singh"
    ]
  },
  {
    "title": "Civil Procedure Code - Key Provisions",
    "content": "The Code of Civil Procedure (CPC) governs civil proceedings in India. Key provisions include: Order 1 (Parties to Suits), Order 2 (Frame of Suit), Order 6 (Pleadings), Order 7 (Plaint), Order 8 (Written Statement), Order 9 (Appearance of Parties), Order 10 (Examination of Parties), Order 11 (Discovery and Inspection), Order 12 (Admissions), Order 13 (Production of Documents), Order 14 (Issues), Order 15 (Disposal of Suit), Order 16 (Summoning and Attendance of Witnesses), Order 17 (Adjournments), Order 18 (Hearing of Suit), Order 19 (Affidavits), Order 20 (Judgment), Order 21 (Execution of Decrees), Order 22 (Death of Parties), Order 23 (Withdrawal and Adjustment), Order 24 (Payment into Court), Order 25 (Security for Costs), Order 26 (Commissions), Order 27 (Suits by or against Government), Order 28 (Suits by or against Military Personnel), Order 29 (Suits by or against Corporations), Order 30 (Suits by or against Firms), Order 31 (Suits by or against Trustees), Order 32 (Suits by or against Minors), Order 33 (Suits by Indigent Persons), Order 34 (Suits relating to Mortgages), Order 35 (Interpleader), Order 36 (Special Case), Order 37 (Summary Procedure), Order 38 (Arrest before Judgment), Order 39 (Temporary Injunctions), Order 40 (Appointment of Receivers), Order 41 (Appeals from Original Decrees), Order 42 (Appeals from Appellate Decrees), Order 43 (Appeals from Orders), Order 44 (Appeals by Indigent Persons), Order 45 (Appeals to Supreme Court), Order 46 (Reference), Order 47 (Review), Order 48 (Miscellaneous), Order 49 (Chartered High Courts), Order 50 (Provincial Small Cause Courts), Order 51 (Miscellaneous).",
    "category": "civil_procedure",
    "citations": [
      "CPC 1908",
      "Order 1-51",
      "State of U.P. v. Jai Bir Singh"
    ]
  }
]